[
  {
    "creator": "BrianKrebs",
    "title": "Cloudflare Scrubs Aisuru Botnet from Top Domains List",
    "link": "https://krebsonsecurity.com/2025/11/cloudflare-scrubs-aisuru-botnet-from-top-domains-list/",
    "pubDate": "Thu, 06 Nov 2025 02:04:36 +0000",
    "content:encoded": "<p>For the past week, domains associated with the massive <strong>Aisuru</strong> botnet have repeatedly usurped <strong>Amazon</strong>, <strong>Apple</strong>, <strong>Google</strong> and <strong>Microsoft</strong> in Cloudflare&#8217;s public ranking of the most frequently requested websites. Cloudflare responded by redacting Aisuru domain names from their top websites list. The chief executive at Cloudflare says Aisuru&#8217;s overlords are using the botnet to boost their malicious domain rankings, while simultaneously attacking the company&#8217;s domain name system (DNS) service.</p>\n<div id=\"attachment_72541\" style=\"width: 757px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-72541\" decoding=\"async\" class=\" wp-image-72541\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/11/CFRadar-Aisuru-redacted.png\" alt=\"\" width=\"747\" height=\"529\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2025/11/CFRadar-Aisuru-redacted.png 1140w, https://krebsonsecurity.com/wp-content/uploads/2025/11/CFRadar-Aisuru-redacted-768x544.png 768w, https://krebsonsecurity.com/wp-content/uploads/2025/11/CFRadar-Aisuru-redacted-782x554.png 782w, https://krebsonsecurity.com/wp-content/uploads/2025/11/CFRadar-Aisuru-redacted-100x70.png 100w\" sizes=\"(max-width: 747px) 100vw, 747px\" /><p id=\"caption-attachment-72541\" class=\"wp-caption-text\">The #1 and #3 positions in this chart are Aisuru botnet controllers with their full domain names redacted. Source: radar.cloudflare.com.</p></div>\n<p>Aisuru is a rapidly growing botnet comprising hundreds of thousands of hacked Internet of Things (IoT) devices, such as poorly secured Internet routers and security cameras. The botnet has <a href=\"https://krebsonsecurity.com/2025/10/aisuru-botnet-shifts-from-ddos-to-residential-proxies/\" target=\"_blank\" rel=\"noopener\">increased in size and firepower significantly since its debut in 2024</a>, demonstrating the ability <a href=\"https://krebsonsecurity.com/2025/10/ddos-botnet-aisuru-blankets-us-isps-in-record-ddos/\" target=\"_blank\" rel=\"noopener\">to launch record distributed denial-of-service (DDoS) attacks</a> nearing 30 terabits of data per second.</p>\n<p>Until recently, Aisuru&#8217;s malicious code instructed all infected systems to use DNS servers from Google &#8212; specifically, the servers at 8.8.8.8. But in early October, Aisuru switched to invoking Cloudflare&#8217;s main DNS server &#8212; 1.1.1.1 &#8212; and over the past week domains used by Aisuru to control infected systems started populating Cloudflare&#8217;s top domain rankings.</p>\n<p>As screenshots of Aisuru domains claiming two of the Top 10 positions ping-ponged across social media, many feared this was yet another sign that an already untamable botnet was running completely amok. One Aisuru botnet domain that sat prominently for days at #1 on the list was someone&#8217;s street address in Massachusetts followed by &#8220;.com&#8221;. Other Aisuru domains mimicked those belonging to major cloud providers.</p>\n<p>Cloudflare tried to address these security, brand confusion and privacy concerns by partially redacting the malicious domains, and adding a warning at the top of its rankings:</p>\n<p>&#8220;Note that the top 100 domains and trending domains lists include domains with organic activity as well as domains with emerging malicious behavior.&#8221;</p>\n<p><img decoding=\"async\" loading=\"lazy\" class=\"aligncenter wp-image-72551\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/11/cfradar-warning.png\" alt=\"\" width=\"675\" height=\"466\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2025/11/cfradar-warning.png 613w, https://krebsonsecurity.com/wp-content/uploads/2025/11/cfradar-warning-100x70.png 100w\" sizes=\"(max-width: 675px) 100vw, 675px\" /></p>\n<p>Cloudflare CEO <strong>Matthew Prince</strong> told KrebsOnSecurity the company&#8217;s domain ranking system is fairly simplistic, and that it merely measures the volume of DNS queries to 1.1.1.1.</p>\n<p>&#8220;The attacker is just generating a ton of requests, maybe to influence the ranking but also to attack our DNS service,&#8221; Prince said, adding that Cloudflare has heard reports of other large public DNS services seeing similar uptick in attacks. &#8220;We’re fixing the ranking to make it smarter. And, in the meantime, redacting any sites we classify as malware.&#8221;<span id=\"more-72528\"></span></p>\n<p><strong>Renee Burton</strong>, vice president of threat intel at the DNS security firm <strong>Infoblox</strong>, said many people erroneously assumed that the skewed Cloudflare domain rankings meant there were more bot-infected devices than there were regular devices querying sites like Google and Apple and Microsoft.</p>\n<p>&#8220;Cloudflare&#8217;s documentation is clear &#8212; they know that when it comes to ranking domains you have to make choices on how to normalize things,&#8221; Burton <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7391657470152228864/\" target=\"_blank\" rel=\"noopener\">wrote</a> on <strong>LinkedIn</strong>. &#8220;There are many aspects that are simply out of your control. Why is it hard? Because reasons. TTL values, caching, prefetching, architecture, load balancing. Things that have shared control between the domain owner and everything in between.&#8221;</p>\n<p><strong>Alex Greenland</strong> is CEO of the anti-phishing and security firm <strong>Epi</strong>. Greenland said he understands the technical reason why Aisuru botnet domains are showing up in Cloudflare&#8217;s rankings (those rankings are based on DNS query volume, not actual web visits). But he said they&#8217;re still not meant to be there.</p>\n<p>&#8220;It&#8217;s a failure on Cloudflare&#8217;s part, and reveals a compromise of the trust and integrity of their rankings,&#8221; he said.</p>\n<p>Greenland said Cloudflare planned for its Domain Rankings to list the most popular domains as used by human users, and it was never meant to be a raw calculation of query frequency or traffic volume going through their 1.1.1.1 DNS resolver.</p>\n<p>&#8220;They spelled out how their popularity algorithm is designed to reflect real human use and exclude automated traffic (they said they&#8217;re good at this),&#8221; Greenland <a href=\"https://www.linkedin.com/posts/activity-7390787635759173632-pycT?utm_source=share&amp;utm_medium=member_desktop&amp;rcm=ACoAAAAliaMB3BQO-WOS-eUh-XU4HAd5h8pTzkI\" target=\"_blank\" rel=\"noopener\">wrote</a> on LinkedIn. &#8220;So something has evidently gone wrong internally. We should have two rankings: one representing trust and real human use, and another derived from raw DNS volume.&#8221;</p>\n<p>Why might it be a good idea to wholly separate malicious domains from the list? Greenland notes that Cloudflare Domain Rankings see widespread use for trust and safety determination, by browsers, DNS resolvers, safe browsing APIs and things like <a href=\"https://tranco-list.eu/\" target=\"_blank\" rel=\"noopener\">TRANCO</a>.</p>\n<p>&#8220;TRANCO is a respected open source list of the top million domains, and Cloudflare Radar is one of their five data providers,&#8221; he continued. &#8220;So there can be serious knock-on effects when a malicious domain features in Cloudflare&#8217;s top 10/100/1000/million. To many people and systems, the top 10 and 100 are naively considered safe and trusted, even though algorithmically-defined top-N lists will always be somewhat crude.&#8221;</p>\n<p>Over this past week, Cloudflare started redacting portions of the malicious Aisuru domains from its Top Domains list, leaving only their domain suffix visible. Sometime in the past 24 hours, Cloudflare appears to have begun hiding the malicious Aisuru domains entirely from the web version of that list. However, downloading a spreadsheet of the current Top 200 domains from Cloudflare Radar shows an Aisuru domain still at the very top.</p>\n<p>According to Cloudflare&#8217;s website, the majority of DNS queries to the top Aisuru domains &#8212; nearly 52 percent &#8212; originated from the United States. This tracks with <a href=\"https://krebsonsecurity.com/2025/10/ddos-botnet-aisuru-blankets-us-isps-in-record-ddos/\" target=\"_blank\" rel=\"noopener\">my reporting from early October</a>, which found Aisuru was drawing most of its firepower from IoT devices hosted on U.S. Internet providers like <strong>AT&amp;T</strong>, <strong>Comcast</strong> and <strong>Verizon</strong>.</p>\n<p>Experts tracking Aisuru say the botnet relies on well more than a hundred control servers, and that for the moment at least most of those domains are registered in the .su top-level domain (TLD). Dot-su is the TLD assigned to the former Soviet Union (.su&#8217;s <a href=\"https://en.wikipedia.org/wiki/.su\" target=\"_blank\" rel=\"noopener\">Wikipedia page</a> says the TLD was created just 15 months before the fall of the Berlin wall).</p>\n<p>A <a href=\"https://blog.cloudflare.com/introducing-tld-insights-on-cloudflare-radar/\" target=\"_blank\" rel=\"noopener\">Cloudflare blog post from October 27</a> found that .su had the highest &#8220;DNS magnitude&#8221; of any TLD, referring to a metric estimating the popularity of a TLD based on the number of unique networks querying Cloudflare&#8217;s 1.1.1.1 resolver. The report concluded that the top .su hostnames were associated with a popular online world-building game, and that more than half of the queries for that TLD came from the United States, Brazil and Germany [it&#8217;s worth noting that servers for the world-building game <strong>Minecraft</strong> were <a href=\"https://krebsonsecurity.com/wp-content/uploads/2025/10/tcpshield-aisuru.png\" target=\"_blank\" rel=\"noopener\">some of Aisuru&#8217;s most frequent targets</a>].</p>\n<p>A simple and crude way to detect Aisuru bot activity on a network may be to set an alert on any systems attempting to contact domains ending in .su. This TLD is frequently abused for cybercrime and by cybercrime forums and services, and blocking access to it entirely is unlikely to raise any legitimate complaints.</p>\n",
    "content:encodedSnippet": "For the past week, domains associated with the massive Aisuru botnet have repeatedly usurped Amazon, Apple, Google and Microsoft in Cloudflare’s public ranking of the most frequently requested websites. Cloudflare responded by redacting Aisuru domain names from their top websites list. The chief executive at Cloudflare says Aisuru’s overlords are using the botnet to boost their malicious domain rankings, while simultaneously attacking the company’s domain name system (DNS) service.\n\nThe #1 and #3 positions in this chart are Aisuru botnet controllers with their full domain names redacted. Source: radar.cloudflare.com.\n\nAisuru is a rapidly growing botnet comprising hundreds of thousands of hacked Internet of Things (IoT) devices, such as poorly secured Internet routers and security cameras. The botnet has increased in size and firepower significantly since its debut in 2024, demonstrating the ability to launch record distributed denial-of-service (DDoS) attacks nearing 30 terabits of data per second.\nUntil recently, Aisuru’s malicious code instructed all infected systems to use DNS servers from Google — specifically, the servers at 8.8.8.8. But in early October, Aisuru switched to invoking Cloudflare’s main DNS server — 1.1.1.1 — and over the past week domains used by Aisuru to control infected systems started populating Cloudflare’s top domain rankings.\nAs screenshots of Aisuru domains claiming two of the Top 10 positions ping-ponged across social media, many feared this was yet another sign that an already untamable botnet was running completely amok. One Aisuru botnet domain that sat prominently for days at #1 on the list was someone’s street address in Massachusetts followed by “.com”. Other Aisuru domains mimicked those belonging to major cloud providers.\nCloudflare tried to address these security, brand confusion and privacy concerns by partially redacting the malicious domains, and adding a warning at the top of its rankings:\n“Note that the top 100 domains and trending domains lists include domains with organic activity as well as domains with emerging malicious behavior.”\n\nCloudflare CEO Matthew Prince told KrebsOnSecurity the company’s domain ranking system is fairly simplistic, and that it merely measures the volume of DNS queries to 1.1.1.1.\n“The attacker is just generating a ton of requests, maybe to influence the ranking but also to attack our DNS service,” Prince said, adding that Cloudflare has heard reports of other large public DNS services seeing similar uptick in attacks. “We’re fixing the ranking to make it smarter. And, in the meantime, redacting any sites we classify as malware.”\nRenee Burton, vice president of threat intel at the DNS security firm Infoblox, said many people erroneously assumed that the skewed Cloudflare domain rankings meant there were more bot-infected devices than there were regular devices querying sites like Google and Apple and Microsoft.\n“Cloudflare’s documentation is clear — they know that when it comes to ranking domains you have to make choices on how to normalize things,” Burton wrote on LinkedIn. “There are many aspects that are simply out of your control. Why is it hard? Because reasons. TTL values, caching, prefetching, architecture, load balancing. Things that have shared control between the domain owner and everything in between.”\nAlex Greenland is CEO of the anti-phishing and security firm Epi. Greenland said he understands the technical reason why Aisuru botnet domains are showing up in Cloudflare’s rankings (those rankings are based on DNS query volume, not actual web visits). But he said they’re still not meant to be there.\n“It’s a failure on Cloudflare’s part, and reveals a compromise of the trust and integrity of their rankings,” he said.\nGreenland said Cloudflare planned for its Domain Rankings to list the most popular domains as used by human users, and it was never meant to be a raw calculation of query frequency or traffic volume going through their 1.1.1.1 DNS resolver.\n“They spelled out how their popularity algorithm is designed to reflect real human use and exclude automated traffic (they said they’re good at this),” Greenland wrote on LinkedIn. “So something has evidently gone wrong internally. We should have two rankings: one representing trust and real human use, and another derived from raw DNS volume.”\nWhy might it be a good idea to wholly separate malicious domains from the list? Greenland notes that Cloudflare Domain Rankings see widespread use for trust and safety determination, by browsers, DNS resolvers, safe browsing APIs and things like TRANCO.\n“TRANCO is a respected open source list of the top million domains, and Cloudflare Radar is one of their five data providers,” he continued. “So there can be serious knock-on effects when a malicious domain features in Cloudflare’s top 10/100/1000/million. To many people and systems, the top 10 and 100 are naively considered safe and trusted, even though algorithmically-defined top-N lists will always be somewhat crude.”\nOver this past week, Cloudflare started redacting portions of the malicious Aisuru domains from its Top Domains list, leaving only their domain suffix visible. Sometime in the past 24 hours, Cloudflare appears to have begun hiding the malicious Aisuru domains entirely from the web version of that list. However, downloading a spreadsheet of the current Top 200 domains from Cloudflare Radar shows an Aisuru domain still at the very top.\nAccording to Cloudflare’s website, the majority of DNS queries to the top Aisuru domains — nearly 52 percent — originated from the United States. This tracks with my reporting from early October, which found Aisuru was drawing most of its firepower from IoT devices hosted on U.S. Internet providers like AT&T, Comcast and Verizon.\nExperts tracking Aisuru say the botnet relies on well more than a hundred control servers, and that for the moment at least most of those domains are registered in the .su top-level domain (TLD). Dot-su is the TLD assigned to the former Soviet Union (.su’s Wikipedia page says the TLD was created just 15 months before the fall of the Berlin wall).\nA Cloudflare blog post from October 27 found that .su had the highest “DNS magnitude” of any TLD, referring to a metric estimating the popularity of a TLD based on the number of unique networks querying Cloudflare’s 1.1.1.1 resolver. The report concluded that the top .su hostnames were associated with a popular online world-building game, and that more than half of the queries for that TLD came from the United States, Brazil and Germany [it’s worth noting that servers for the world-building game Minecraft were some of Aisuru’s most frequent targets].\nA simple and crude way to detect Aisuru bot activity on a network may be to set an alert on any systems attempting to contact domains ending in .su. This TLD is frequently abused for cybercrime and by cybercrime forums and services, and blocking access to it entirely is unlikely to raise any legitimate complaints.",
    "dc:creator": "BrianKrebs",
    "comments": "https://krebsonsecurity.com/2025/11/cloudflare-scrubs-aisuru-botnet-from-top-domains-list/#respond",
    "content": "For the past week, domains associated with the massive Aisuru botnet have repeatedly usurped Amazon, Apple, Google and Microsoft in Cloudflare's public ranking of the most frequently requested websites. Cloudflare responded by redacting Aisuru domain names from their top websites list. The chief executive at Cloudflare says Aisuru's overlords are using the botnet to boost their malicious domain rankings, while simultaneously attacking the company's domain name system (DNS) service.",
    "contentSnippet": "For the past week, domains associated with the massive Aisuru botnet have repeatedly usurped Amazon, Apple, Google and Microsoft in Cloudflare's public ranking of the most frequently requested websites. Cloudflare responded by redacting Aisuru domain names from their top websites list. The chief executive at Cloudflare says Aisuru's overlords are using the botnet to boost their malicious domain rankings, while simultaneously attacking the company's domain name system (DNS) service.",
    "guid": "https://krebsonsecurity.com/?p=72528",
    "categories": [
      "A Little Sunshine",
      "DDoS-for-Hire",
      "Internet of Things (IoT)",
      "Web Fraud 2.0",
      "Aisuru",
      "Alex Greenland",
      "Amazon",
      "CloudFlare",
      "Cloudflare Radar",
      "Epi",
      "Google Apple",
      "Infoblox",
      "Matthew Prince",
      "microsoft",
      "Renee Burton"
    ],
    "isoDate": "2025-11-06T02:04:36.000Z"
  },
  {
    "creator": "Ali Winston",
    "title": "Zohran Mamdani Just Inherited the NYPD Surveillance State",
    "link": "https://www.wired.com/story/welcome-to-mamdanis-surveillance-state/",
    "pubDate": "Wed, 05 Nov 2025 17:51:01 +0000",
    "dc:creator": "Ali Winston",
    "content": "In addition to affordability, New York City’s mayor-elect will be forced to reckon with the NYPD’s sweeping mass surveillance operations.",
    "contentSnippet": "In addition to affordability, New York City’s mayor-elect will be forced to reckon with the NYPD’s sweeping mass surveillance operations.",
    "guid": "690902754e544e9de926c80c",
    "categories": [
      "Security",
      "Security / National Security",
      "Security / Privacy",
      "Security / Security News",
      "Politics / Policy"
    ],
    "isoDate": "2025-11-05T17:51:01.000Z"
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "Google Uncovers PROMPTFLUX Malware That Uses Gemini AI to Rewrite Its Code Hourly",
    "link": "https://thehackernews.com/2025/11/google-uncovers-promptflux-malware-that.html",
    "pubDate": "Wed, 05 Nov 2025 21:03:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiv38bGYR4EsJddvrYIBdRlGLM4tSJFssQPifDWhLZFtuM0QGkNOR0HbuqK-3IkkBjlJhR0vhrxGOGMIqZYbT790fs70gtCQnNhDI5bwiozuLoj8-onQQrotBV-IVVCNmHFFBWWfJMpCQEtnYCli4lyGz9bRpMfr6T3aFHRMOrNfpuGaPihD-D3LdLn3yO_/s1600/malware-code.jpg"
    },
    "content": "Google on Wednesday said it discovered an unknown threat actor using an experimental Visual Basic Script (VB Script) malware dubbed PROMPTFLUX that interacts with its Gemini artificial intelligence (AI) model API to write its own source code for improved obfuscation and evasion.\n\"PROMPTFLUX is written in VBScript and interacts with Gemini's API to request specific VBScript obfuscation and",
    "contentSnippet": "Google on Wednesday said it discovered an unknown threat actor using an experimental Visual Basic Script (VB Script) malware dubbed PROMPTFLUX that interacts with its Gemini artificial intelligence (AI) model API to write its own source code for improved obfuscation and evasion.\n\"PROMPTFLUX is written in VBScript and interacts with Gemini's API to request specific VBScript obfuscation and",
    "guid": "https://thehackernews.com/2025/11/google-uncovers-promptflux-malware-that.html",
    "isoDate": "2025-11-05T15:33:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "Researchers Find ChatGPT Vulnerabilities That Let Attackers Trick AI Into Leaking Data",
    "link": "https://thehackernews.com/2025/11/researchers-find-chatgpt.html",
    "pubDate": "Wed, 05 Nov 2025 19:34:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjc9u8ifBTtqcucAGtnB5BSuB4Zu2PTcSopIDhD1mxnUeFmAtb1KWyJuU3Yb8JAnJ-nQ4jltxhO5YCFzfd-VhbghvU9B8DewcX9kDZ4Wv65q-3Sqnj-tyAtaL2BNI_poMHKzeJMr93cjTv7U9lqZFSpLOgs0mYOjIA0QqYydcxGmxxqZGS-YS8hJUi8sdsJ/s1600/chatgpt-hack.jpg"
    },
    "content": "Cybersecurity researchers have disclosed a new set of vulnerabilities impacting OpenAI's ChatGPT artificial intelligence (AI) chatbot that could be exploited by an attacker to steal personal information from users' memories and chat histories without their knowledge.\nThe seven vulnerabilities and attack techniques, according to Tenable, were found in OpenAI's GPT-4o and GPT-5 models. OpenAI has",
    "contentSnippet": "Cybersecurity researchers have disclosed a new set of vulnerabilities impacting OpenAI's ChatGPT artificial intelligence (AI) chatbot that could be exploited by an attacker to steal personal information from users' memories and chat histories without their knowledge.\nThe seven vulnerabilities and attack techniques, according to Tenable, were found in OpenAI's GPT-4o and GPT-5 models. OpenAI has",
    "guid": "https://thehackernews.com/2025/11/researchers-find-chatgpt.html",
    "isoDate": "2025-11-05T14:04:00.000Z",
    "itunes": {}
  },
  {
    "creator": "Bruce Schneier",
    "title": "Scientists Need a Positive Vision for AI",
    "link": "https://www.schneier.com/blog/archives/2025/11/scientists-need-a-positive-vision-for-ai.html",
    "pubDate": "Wed, 05 Nov 2025 12:04:34 +0000",
    "content:encoded": "<p>For many in the research community, it&#8217;s gotten harder to be optimistic about the impacts of <a href=\"https://spectrum.ieee.org/topic/artificial-intelligence/\">artificial intelligence</a>.</p>\n<p>As authoritarianism is rising around the world, AI-generated &#8220;slop&#8221; is overwhelming legitimate media, while AI-generated <a href=\"https://spectrum.ieee.org/tag/deepfakes\">deepfakes</a> are spreading <a href=\"https://spectrum.ieee.org/tag/misinformation\">misinformation</a> and parroting extremist messages. AI is making warfare more precise and deadly amidst intransigent conflicts. AI companies are exploiting people in the global South who work as data labelers, and profiting from content creators worldwide by using their work without license or compensation. The industry is also affecting an already-roiling climate with its <a href=\"https://spectrum.ieee.org/ai-energy-use\">enormous energy demands</a>.</p>\n<p>Meanwhile, particularly in the <a href=\"https://spectrum.ieee.org/tag/united-states\">United States</a>, public investment in science seems to be <a href=\"https://www.aau.edu/newsroom/leading-research-universities-report/white-house-proposes-steep-cuts-science-and-education\">redirected</a> and <a href=\"https://www.aip.org/fyi/trump-plan-highlights-ai-for-science\">concentrated</a> on AI at the expense of other disciplines. And <a href=\"https://spectrum.ieee.org/tag/big-tech\">Big Tech</a> companies are consolidating their control over the AI ecosystem. In these ways and others, AI seems to be making everything worse.</p>\n<p>This is not the whole story. We should not resign ourselves to AI being harmful to humanity. None of us should accept this as inevitable, especially those in a position to influence science, government, and society. Scientists and engineers can push AI towards a beneficial path. Here&#8217;s how.</p>\n<h3>The Academy&#8217;s View of AI</h3>\n<p>A <a href=\"https://www.pewresearch.org/internet/2025/04/03/how-the-us-public-and-ai-experts-view-artificial-intelligence/\">Pew study</a> in April found that 56 percent of AI experts (authors and presenters of AI-related conference papers) predict that AI will have positive effects on society. But that optimism doesn&#8217;t extend to the scientific community at large. A 2023 <a href=\"https://sci-ops.org/survey/artificial-intelligence-survey-x/scientists-perceptions-and-personal-use/\">survey</a> of 232 scientists by the Center for Science, Technology and <a href=\"https://spectrum.ieee.org/tag/environmental-policy\">Environmental Policy</a> Studies at Arizona State University found more concern than excitement about the use of <a href=\"https://spectrum.ieee.org/tag/generative-ai\">generative AI</a> in daily life&#8212;by nearly a three to one ratio.</p>\n<p>We have encountered this sentiment repeatedly. Our careers of diverse applied work have brought us in contact with many research communities: privacy, <a href=\"https://spectrum.ieee.org/tag/cybersecurity\">cybersecurity</a>, physical sciences, <a href=\"https://spectrum.ieee.org/tag/drug-discovery\">drug discovery</a>, <a href=\"https://spectrum.ieee.org/tag/public-health\">public health</a>, public interest technology, and democratic innovation. In all of these fields, we&#8217;ve found strong negative sentiment about the impacts of AI. The feeling is so palpable that we&#8217;ve often been asked to represent the voice of the AI optimist, even though we spend most of our time writing about the need to reform the structures of AI development.</p>\n<p>We understand why these audiences see AI as a destructive force, but this negativity engenders a different concern: that those with the potential to guide the development of AI and steer its influence on society will view it as a lost cause and sit out that process.</p>\n<h3>Elements of a Positive Vision for AI</h3>\n<p><a href=\"https://www.islandinstitute.org/working-waterfront/hope-a-framework-for-climate-action/\">Many</a> <a href=\"https://time.com/7178677/climate-scientist-optimist-refuse-to-give-up-hope/\">have</a> <a href=\"https://www.nature.com/articles/s41467-018-05977-w\">a</a><a href=\"https://www.nature.com/articles/s41467-018-05977-w\">rgu</a><a href=\"https://www.nature.com/articles/s41467-018-05977-w\">ed</a> <a href=\"https://behavioralscientist.org/we-need-to-change-the-way-we-talk-about-climate-change/\">that</a> <a href=\"https://www.forbes.com/sites/avivahwittenbergcox/2023/04/17/the-power-of-climate-optimists-flip-the-narrative-change-the-future/\">turn</a><a href=\"https://www.forbes.com/sites/avivahwittenbergcox/2023/04/17/the-power-of-climate-optimists-flip-the-narrative-change-the-future/\">ing</a> the <a href=\"https://climate.mit.edu/podcasts/making-case-climate-optimism\">tide</a> of climate action requires clearly articulating a path towards positive outcomes. In the same way, while scientists and technologists should anticipate, warn against, and help mitigate the potential harms of AI, they should also highlight the ways the technology can be harnessed for good, galvanizing public action towards those ends.</p>\n<p>There are myriad ways to leverage and reshape AI to improve peoples&#8217; lives, distribute rather than concentrate power, and even strengthen democratic processes. Many examples have arisen from the scientific community and deserve to be celebrated.</p>\n<p>Some examples: AI is eliminating communication barriers across languages, including under-resourced contexts like <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=5230744\">marginalized sign languages</a> and <a href=\"https://ojs.bilpub.com/index.php/card/article/view/517\">indigenous African languages</a>. It is helping policymakers incorporate the viewpoints of many constituents through AI-assisted <a href=\"https://www.science.org/doi/abs/10.1126/science.adq2852\">deliberations</a> and <a href=\"https://static.ie.edu/CGC/AI4D%20Paper%203%20Applications%20of%20Artificial%20Intelligence%20Tools%20to%20Engance%20Legislative%20Engagement.pdf\">legislative engagement</a>. <a href=\"https://spectrum.ieee.org/tag/large-language-models\">Large language models</a> can scale individual dialogs to <a href=\"https://osf.io/mqcwj_v1/\">a</a><a href=\"https://osf.io/mqcwj_v1/\">ddress</a><a href=\"https://osf.io/mqcwj_v1/\"> climate</a><a href=\"https://osf.io/mqcwj_v1/\">&#8211;</a><a href=\"https://osf.io/mqcwj_v1/\">change skepticism</a>, spreading accurate information at a critical moment. National labs are building AI <a href=\"https://www.anl.gov/cels/auroragpt-foundation-models-for-science\">foundation models</a> to accelerate scientific research. And throughout the fields of medicine and biology, <a href=\"https://spectrum.ieee.org/tag/machine-learning\">machine learning</a> is solving scientific problems like the prediction of protein structure in aid of drug discovery, which was recognized with a <a href=\"https://www.nobelprize.org/prizes/chemistry/2024/press-release/\">Nobel Prize</a> in 2024.</p>\n<p>While each of these applications is nascent and surely imperfect, they all demonstrate that AI can be wielded to advance the public interest. Scientists should embrace, champion, and expand on such efforts.</p>\n<h3>A Call to Action for Scientists</h3>\n<p>In our new book, <em><a href=\"https://mitpress.mit.edu/9780262049948/rewiring-democracy/\">Rewiring Democracy: How AI Will Transform Our Politics, Government, and Citizenship</a></em>, we describe four key actions for policymakers committed to steering AI toward the public good.</p>\n<p>These apply to scientists as well. Researchers should work to <strong>reform</strong> the AI industry to be more ethical, equitable, and trustworthy. We must collectively <a href=\"https://www.unesco.org/en/legal-affairs/recommendation-ethics-artificial-intelligence\">develop</a> <a href=\"https://www.pnas.org/doi/10.1073/pnas.2407886121\">ethical</a> <a href=\"https://link.springer.com/article/10.1007/s43681-024-00493-8\">norms</a> for research that advance and applies AI, and should use and draw attention to AI developers who adhere to those norms.</p>\n<p>Second, we should <strong>resist</strong> harmful uses of AI by documenting the negative applications of AI and casting a light on inappropriate uses.</p>\n<p>Third, we should <strong>responsibly use</strong> AI to make society and peoples&#8217; lives better, exploiting its capabilities to help the communities they serve.</p>\n<p>And finally, we must advocate for the <strong>renovation</strong> of institutions to prepare them for the impacts of AI; universities, professional societies, and democratic organizations are all vulnerable to disruption.</p>\n<p>Scientists have a special privilege and responsibility: We are close to the technology itself and therefore well positioned to influence its trajectory. We must work to create an AI-infused world that we want to live in. Technology, as the historian <a href=\"https://www.jstor.org/stable/3105385\">Melvin Kranzberg observed</a>, &#8220;is neither good nor bad; nor is it neutral.&#8221; Whether the AI we build is detrimental or beneficial to society depends on the choices we make today. But we cannot create a positive future without a vision of what it looks like.</p>\n<p><em>This essay was written with Nathan E. Sanders, and originally appeared in <a href=\"https://spectrum.ieee.org/responsible-ai\">IEEE Spectrum</a>.</em></p>\n",
    "content:encodedSnippet": "For many in the research community, it’s gotten harder to be optimistic about the impacts of artificial intelligence.\nAs authoritarianism is rising around the world, AI-generated “slop” is overwhelming legitimate media, while AI-generated deepfakes are spreading misinformation and parroting extremist messages. AI is making warfare more precise and deadly amidst intransigent conflicts. AI companies are exploiting people in the global South who work as data labelers, and profiting from content creators worldwide by using their work without license or compensation. The industry is also affecting an already-roiling climate with its enormous energy demands.\nMeanwhile, particularly in the United States, public investment in science seems to be redirected and concentrated on AI at the expense of other disciplines. And Big Tech companies are consolidating their control over the AI ecosystem. In these ways and others, AI seems to be making everything worse.\nThis is not the whole story. We should not resign ourselves to AI being harmful to humanity. None of us should accept this as inevitable, especially those in a position to influence science, government, and society. Scientists and engineers can push AI towards a beneficial path. Here’s how.\nThe Academy’s View of AI\nA Pew study in April found that 56 percent of AI experts (authors and presenters of AI-related conference papers) predict that AI will have positive effects on society. But that optimism doesn’t extend to the scientific community at large. A 2023 survey of 232 scientists by the Center for Science, Technology and Environmental Policy Studies at Arizona State University found more concern than excitement about the use of generative AI in daily life—by nearly a three to one ratio.\nWe have encountered this sentiment repeatedly. Our careers of diverse applied work have brought us in contact with many research communities: privacy, cybersecurity, physical sciences, drug discovery, public health, public interest technology, and democratic innovation. In all of these fields, we’ve found strong negative sentiment about the impacts of AI. The feeling is so palpable that we’ve often been asked to represent the voice of the AI optimist, even though we spend most of our time writing about the need to reform the structures of AI development.\nWe understand why these audiences see AI as a destructive force, but this negativity engenders a different concern: that those with the potential to guide the development of AI and steer its influence on society will view it as a lost cause and sit out that process.\nElements of a Positive Vision for AI\nMany have argued that turning the tide of climate action requires clearly articulating a path towards positive outcomes. In the same way, while scientists and technologists should anticipate, warn against, and help mitigate the potential harms of AI, they should also highlight the ways the technology can be harnessed for good, galvanizing public action towards those ends.\nThere are myriad ways to leverage and reshape AI to improve peoples’ lives, distribute rather than concentrate power, and even strengthen democratic processes. Many examples have arisen from the scientific community and deserve to be celebrated.\nSome examples: AI is eliminating communication barriers across languages, including under-resourced contexts like marginalized sign languages and indigenous African languages. It is helping policymakers incorporate the viewpoints of many constituents through AI-assisted deliberations and legislative engagement. Large language models can scale individual dialogs to address climate–change skepticism, spreading accurate information at a critical moment. National labs are building AI foundation models to accelerate scientific research. And throughout the fields of medicine and biology, machine learning is solving scientific problems like the prediction of protein structure in aid of drug discovery, which was recognized with a Nobel Prize in 2024.\nWhile each of these applications is nascent and surely imperfect, they all demonstrate that AI can be wielded to advance the public interest. Scientists should embrace, champion, and expand on such efforts.\nA Call to Action for Scientists\nIn our new book, Rewiring Democracy: How AI Will Transform Our Politics, Government, and Citizenship, we describe four key actions for policymakers committed to steering AI toward the public good.\nThese apply to scientists as well. Researchers should work to reform the AI industry to be more ethical, equitable, and trustworthy. We must collectively develop ethical norms for research that advance and applies AI, and should use and draw attention to AI developers who adhere to those norms.\nSecond, we should resist harmful uses of AI by documenting the negative applications of AI and casting a light on inappropriate uses.\nThird, we should responsibly use AI to make society and peoples’ lives better, exploiting its capabilities to help the communities they serve.\nAnd finally, we must advocate for the renovation of institutions to prepare them for the impacts of AI; universities, professional societies, and democratic organizations are all vulnerable to disruption.\nScientists have a special privilege and responsibility: We are close to the technology itself and therefore well positioned to influence its trajectory. We must work to create an AI-infused world that we want to live in. Technology, as the historian Melvin Kranzberg observed, “is neither good nor bad; nor is it neutral.” Whether the AI we build is detrimental or beneficial to society depends on the choices we make today. But we cannot create a positive future without a vision of what it looks like.\nThis essay was written with Nathan E. Sanders, and originally appeared in IEEE Spectrum.",
    "dc:creator": "Bruce Schneier",
    "comments": "https://www.schneier.com/blog/archives/2025/11/scientists-need-a-positive-vision-for-ai.html#comments",
    "content": "<p>For many in the research community, it&#8217;s gotten harder to be optimistic about the impacts of <a href=\"https://spectrum.ieee.org/topic/artificial-intelligence/\">artificial intelligence</a>.</p>\n<p>As authoritarianism is rising around the world, AI-generated &#8220;slop&#8221; is overwhelming legitimate media, while AI-generated <a href=\"https://spectrum.ieee.org/tag/deepfakes\">deepfakes</a> are spreading <a href=\"https://spectrum.ieee.org/tag/misinformation\">misinformation</a> and parroting extremist messages. AI is making warfare more precise and deadly amidst intransigent conflicts. AI companies are exploiting people in the global South who work as data labelers, and profiting from content creators worldwide by using their work without license or compensation. The industry is also affecting an already-roiling climate with its ...</p>",
    "contentSnippet": "For many in the research community, it’s gotten harder to be optimistic about the impacts of artificial intelligence.\nAs authoritarianism is rising around the world, AI-generated “slop” is overwhelming legitimate media, while AI-generated deepfakes are spreading misinformation and parroting extremist messages. AI is making warfare more precise and deadly amidst intransigent conflicts. AI companies are exploiting people in the global South who work as data labelers, and profiting from content creators worldwide by using their work without license or compensation. The industry is also affecting an already-roiling climate with its ...",
    "guid": "https://www.schneier.com/?p=71112",
    "categories": [
      "Uncategorized",
      "AI",
      "LLM"
    ],
    "isoDate": "2025-11-05T12:04:34.000Z"
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "Securing the Open Android Ecosystem with Samsung Knox",
    "link": "https://thehackernews.com/2025/11/securing-open-android-ecosystem-with.html",
    "pubDate": "Wed, 05 Nov 2025 17:25:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhPd1GerA19wNhABt5LKN6GfthI5rzfkRTbigEYmdoa_xBlhczavPQemf3AG5HSmjAYK3cot1kYKQuceJ90bhNnju1ZD9y_AnwuU_4cPawlBGIJtjtlIO7WnP8PVo4K0UEVJMSayB31YGm0TpferX6BetOhEDyB3v-faGFJB3ehP2Li9g7PpoIEoMLfO5Y/s1600/samsung.jpg"
    },
    "content": "Raise your hand if you’ve heard the myth, “Android isn’t secure.”\nAndroid phones, such as the Samsung Galaxy, unlock new ways of working. But, as an IT admin, you may worry about the security—after all, work data is critical.\nHowever, outdated concerns can hold your business back from unlocking its full potential. The truth is, with work happening everywhere, every device connected to your",
    "contentSnippet": "Raise your hand if you’ve heard the myth, “Android isn’t secure.”\nAndroid phones, such as the Samsung Galaxy, unlock new ways of working. But, as an IT admin, you may worry about the security—after all, work data is critical.\nHowever, outdated concerns can hold your business back from unlocking its full potential. The truth is, with work happening everywhere, every device connected to your",
    "guid": "https://thehackernews.com/2025/11/securing-open-android-ecosystem-with.html",
    "isoDate": "2025-11-05T11:55:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "Mysterious 'SmudgedSerpent' Hackers Target U.S. Policy Experts Amid Iran–Israel Tensions",
    "link": "https://thehackernews.com/2025/11/mysterious-smudgedserpent-hackers.html",
    "pubDate": "Wed, 05 Nov 2025 16:50:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjmp-SI1cgUsmlMG3lE9_zYqMARsZ452j97kJNlUe_E0cqUX6QHXfPp6-pMHEQZuKlr8mzJI004vOCYTQVaygW0V7Mlcd2hmwk599TNk-85utedJE9cPyZO_ezKR3E-THcjGP8xeVc3udXnrCz6OFT8OCqVaZY6xry3kbsJmCJmdcq-Gz9lrUigoyNbEWhz/s1600/hacker-uk.jpg"
    },
    "content": "A never-before-seen threat activity cluster codenamed UNK_SmudgedSerpent has been attributed as behind a set of cyber attacks targeting academics and foreign policy experts between June and August 2025, coinciding with heightened geopolitical tensions between Iran and Israel.\n\"UNK_SmudgedSerpent leveraged domestic political lures, including societal change in Iran and investigation into the",
    "contentSnippet": "A never-before-seen threat activity cluster codenamed UNK_SmudgedSerpent has been attributed as behind a set of cyber attacks targeting academics and foreign policy experts between June and August 2025, coinciding with heightened geopolitical tensions between Iran and Israel.\n\"UNK_SmudgedSerpent leveraged domestic political lures, including societal change in Iran and investigation into the",
    "guid": "https://thehackernews.com/2025/11/mysterious-smudgedserpent-hackers.html",
    "isoDate": "2025-11-05T11:20:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "U.S. Sanctions 10 North Korean Entities for Laundering $12.7M in Crypto and IT Fraud",
    "link": "https://thehackernews.com/2025/11/us-sanctions-10-north-korean-entities.html",
    "pubDate": "Wed, 05 Nov 2025 16:25:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiXIMlJnqx7E3-6UYncV_kGW3LUD3e8ePPnKZ2nWmTSdjlvSMeVGwCwVaJQCYk6KCKcvnmiu1_Ujh_eqgtEJ3JYO2-FVzKTcDFiw5wmXacWEMwFhc3VtV8ZTenImisM-4talaTVCUqZHk1rxXoqY6b4kyHTh53q_OjRYj_MTznsoqhgb_0B8QAVWRc_KVV2/s1600/it-workers.jpg"
    },
    "content": "The U.S. Treasury Department on Tuesday imposed sanctions against eight individuals and two entities within North Korea's global financial network for laundering money for various illicit schemes, including cybercrime and information technology (IT) worker fraud.\n\"North Korean state-sponsored hackers steal and launder money to fund the regime's nuclear weapons program,\" said Under Secretary of",
    "contentSnippet": "The U.S. Treasury Department on Tuesday imposed sanctions against eight individuals and two entities within North Korea's global financial network for laundering money for various illicit schemes, including cybercrime and information technology (IT) worker fraud.\n\"North Korean state-sponsored hackers steal and launder money to fund the regime's nuclear weapons program,\" said Under Secretary of",
    "guid": "https://thehackernews.com/2025/11/us-sanctions-10-north-korean-entities.html",
    "isoDate": "2025-11-05T10:55:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "Why SOC Burnout Can Be Avoided: Practical Steps",
    "link": "https://thehackernews.com/2025/11/why-soc-burnout-can-be-avoided.html",
    "pubDate": "Wed, 05 Nov 2025 16:00:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg2Typv0FhA4kzN6hRhuRsYCb7CNG7u5iId8CN_KCFj3ZCliQ0deQbIUQpJYkupf0dtKZulkLGCahDh0hfY9Ofs3PM5YCMyAnYmQH7ctyr79puTU3l6eOj6BWCt8y1bj_EI0rdT6zYrBeb_qwGuUNCBfIRtLABG51Dpr6SyxoNaV3Xj8QS-ZU01ie7jxEc/s1600/anyrun.jpg"
    },
    "content": "Behind every alert is an analyst; tired eyes scanning dashboards, long nights spent on false positives, and the constant fear of missing something big. It’s no surprise that many SOCs face burnout before they face their next breach. But this doesn’t have to be the norm. The path out isn’t through working harder, but through working smarter, together.\nHere are three practical steps every SOC can",
    "contentSnippet": "Behind every alert is an analyst; tired eyes scanning dashboards, long nights spent on false positives, and the constant fear of missing something big. It’s no surprise that many SOCs face burnout before they face their next breach. But this doesn’t have to be the norm. The path out isn’t through working harder, but through working smarter, together.\nHere are three practical steps every SOC can",
    "guid": "https://thehackernews.com/2025/11/why-soc-burnout-can-be-avoided.html",
    "isoDate": "2025-11-05T10:30:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "CISA Adds Gladinet and CWP Flaws to KEV Catalog Amid Active Exploitation Evidence",
    "link": "https://thehackernews.com/2025/11/cisa-adds-gladinet-and-cwp-flaws-to-kev.html",
    "pubDate": "Wed, 05 Nov 2025 11:42:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgDITEgki_ICpEMcN92xGckaqijjlvW9kC6ZtYS8v1Fmvc50kvsku_Wke0Zk6nK6a27I8kbBHK8GSnlQ8xyGQx0_2WEMTfW4NN9Y5-ANCcPI5lTs7TdQwbaDygSw6KUqCaLW_JBEH1hKyvtVKjyqUs0Uk6xzrCIEW0nVuKt1VHtYv2SqCrHBJDznZQrP84J/s1600/CISA.jpg"
    },
    "content": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Tuesday added two security flaws impacting Gladinet and Control Web Panel (CWP) to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation in the wild.\nThe vulnerabilities in question are listed below -\n\nCVE-2025-11371 (CVSS score: 7.5) - A vulnerability in files or directories accessible to",
    "contentSnippet": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Tuesday added two security flaws impacting Gladinet and Control Web Panel (CWP) to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation in the wild.\nThe vulnerabilities in question are listed below -\n\nCVE-2025-11371 (CVSS score: 7.5) - A vulnerability in files or directories accessible to",
    "guid": "https://thehackernews.com/2025/11/cisa-adds-gladinet-and-cwp-flaws-to-kev.html",
    "isoDate": "2025-11-05T06:12:00.000Z",
    "itunes": {}
  },
  {
    "creator": "Dell Cameron, Caroline Haskins",
    "title": "FBI Warns of Criminals Posing as ICE, Urges Agents to ID Themselves",
    "link": "https://www.wired.com/story/fbi-warns-of-criminals-posing-as-ice-urges-agents-to-id-themselves/",
    "pubDate": "Tue, 04 Nov 2025 19:30:23 +0000",
    "dc:creator": "Dell Cameron, Caroline Haskins",
    "content": "In a bulletin to law enforcement agencies, the FBI said criminal impersonators are exploiting ICE’s image and urged nationwide coordination to distinguish real operations from fakes.",
    "contentSnippet": "In a bulletin to law enforcement agencies, the FBI said criminal impersonators are exploiting ICE’s image and urged nationwide coordination to distinguish real operations from fakes.",
    "guid": "6904b7a28cfd02ec81b59670",
    "categories": [
      "Security",
      "Security / National Security",
      "Security / Security News",
      "Security / Privacy"
    ],
    "isoDate": "2025-11-04T19:30:23.000Z"
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "A Cybercrime Merger Like No Other — Scattered Spider, LAPSUS$, and ShinyHunters Join Forces",
    "link": "https://thehackernews.com/2025/11/a-cybercrime-merger-like-no-other.html",
    "pubDate": "Tue, 04 Nov 2025 22:55:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEihGoqSoqWGCpoOD7hmLTjkWzWhFLusgvTr3g3RaGZWrSs_j4LAGbruNNztuHBQy5D835G8qsA6p2Go0Mw-aSoiHC7eY4-tGNEgXffrQPOIuEiEm0-n6gZHeq156nYnq9S_jRSk22aXI3X7aXXoCJwRRKdMN20Hf4M266ZMRZEsv7NhJTuPWBT6U3OlhQBE/s1600/hackers.jpg"
    },
    "content": "The nascent collective that combines three prominent cybercrime groups, Scattered Spider, LAPSUS$, and ShinyHunters, has created no less than 16 Telegram channels since August 8, 2025.\n\"Since its debut, the group's Telegram channels have been removed and recreated at least 16 times under varying iterations of the original name – a recurring cycle reflecting platform moderation and the operators'",
    "contentSnippet": "The nascent collective that combines three prominent cybercrime groups, Scattered Spider, LAPSUS$, and ShinyHunters, has created no less than 16 Telegram channels since August 8, 2025.\n\"Since its debut, the group's Telegram channels have been removed and recreated at least 16 times under varying iterations of the original name – a recurring cycle reflecting platform moderation and the operators'",
    "guid": "https://thehackernews.com/2025/11/a-cybercrime-merger-like-no-other.html",
    "isoDate": "2025-11-04T17:25:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "European Authorities Dismantle €600 Million Crypto Fraud Network in Global Sweep",
    "link": "https://thehackernews.com/2025/11/europol-and-eurojust-dismantle-600.html",
    "pubDate": "Tue, 04 Nov 2025 21:27:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiWKwScZjfCjIxjAGc2zRp5CurUdQrWfIyggSAeiGwqm0lISlnUZcukvjR3paESZ4ksOr99jBcbTxgnZmmlkbfAomK_9uRWH5cWfZ1yMHpuTwe2MyrQRAJTqyRHnyq0-JHHI0BRQNRoh_YWiLwIcUolW_n1swUtCoQSkiE2Nf0CsWFXNH6FQrSML5QO7xLu/s1600/crypto-scam.jpg"
    },
    "content": "Nine people have been arrested in connection with a coordinated law enforcement operation that targeted a cryptocurrency money laundering network that defrauded victims of €600 million (~$688 million).\nAccording to a statement released by Eurojust today, the action took place between October 27 and 29 across Cyprus, Spain, and Germany, with the suspects arrested on charges of involvement in",
    "contentSnippet": "Nine people have been arrested in connection with a coordinated law enforcement operation that targeted a cryptocurrency money laundering network that defrauded victims of €600 million (~$688 million).\nAccording to a statement released by Eurojust today, the action took place between October 27 and 29 across Cyprus, Spain, and Germany, with the suspects arrested on charges of involvement in",
    "guid": "https://thehackernews.com/2025/11/europol-and-eurojust-dismantle-600.html",
    "isoDate": "2025-11-04T15:57:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "Critical React Native CLI Flaw Exposed Millions of Developers to Remote Attacks",
    "link": "https://thehackernews.com/2025/11/critical-react-native-cli-flaw-exposed.html",
    "pubDate": "Tue, 04 Nov 2025 19:54:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhfNjN6vslUO_G4CduAbYSiA-CSV2SWczVdx8dOAdaWXrulZW9P3iJ6fkO1bN_PlrN1g7pExIbB5QdeO9h7yNQE2yVdSzg2OfbL1N6_K-bNhsguE9GHUilLuEuzpfybL2So0N9yP9J3UiTjjZhyphenhyphen571M1PCgZc4nv-woAH4Ja7q8rl8GZ3rQr4I7tPDhQu4p/s1600/code.jpg"
    },
    "content": "Details have emerged about a now-patched critical security flaw in the popular \"@react-native-community/cli\" npm package that could be potentially exploited to run malicious operating system (OS) commands under certain conditions.\n\"The vulnerability allows remote unauthenticated attackers to easily trigger arbitrary OS command execution on the machine running react-native-community/cli's",
    "contentSnippet": "Details have emerged about a now-patched critical security flaw in the popular \"@react-native-community/cli\" npm package that could be potentially exploited to run malicious operating system (OS) commands under certain conditions.\n\"The vulnerability allows remote unauthenticated attackers to easily trigger arbitrary OS command execution on the machine running react-native-community/cli's",
    "guid": "https://thehackernews.com/2025/11/critical-react-native-cli-flaw-exposed.html",
    "isoDate": "2025-11-04T14:24:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "Microsoft Teams Bugs Let Attackers Impersonate Colleagues and Edit Messages Unnoticed",
    "link": "https://thehackernews.com/2025/11/microsoft-teams-bugs-let-attackers.html",
    "pubDate": "Tue, 04 Nov 2025 19:30:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgPxhWGZawWeHzNGIbomWP8Nbdh5Dd6tcZRBCwh1fzvzwLRHHrOAdfio4nT7DL5Lq7_v0S8mDZ5JcWhL_B75AVaO8pYvvxHr5UbkNOaALx-O3Xj2msk9pV1vHsgTDQjCYfED7yaajgRNK5Qarl8aAWqwk6W0GYG5DwB9MGPnXdrgRhGpgIyNdu5FYPJtPF5/s1600/ms-teams.jpg"
    },
    "content": "Cybersecurity researchers have disclosed details of four security flaws in Microsoft Teams that could have exposed users to serious impersonation and social engineering attacks.\nThe vulnerabilities \"allowed attackers to manipulate conversations, impersonate colleagues, and exploit notifications,\" Check Point said in a report shared with The Hacker News.\nFollowing responsible disclosure in March",
    "contentSnippet": "Cybersecurity researchers have disclosed details of four security flaws in Microsoft Teams that could have exposed users to serious impersonation and social engineering attacks.\nThe vulnerabilities \"allowed attackers to manipulate conversations, impersonate colleagues, and exploit notifications,\" Check Point said in a report shared with The Hacker News.\nFollowing responsible disclosure in March",
    "guid": "https://thehackernews.com/2025/11/microsoft-teams-bugs-let-attackers.html",
    "isoDate": "2025-11-04T14:00:00.000Z",
    "itunes": {}
  },
  {
    "creator": "Bruce Schneier",
    "title": "Cybercriminals Targeting Payroll Sites",
    "link": "https://www.schneier.com/blog/archives/2025/11/cybercriminals-targeting-payroll-sites.html",
    "pubDate": "Tue, 04 Nov 2025 12:05:54 +0000",
    "content:encoded": "<p>Microsoft is <a href=\"https://thehackernews.com/2025/10/microsoft-warns-of-payroll-pirates.html?_m=3n%2e009a%2e3796%2ebx0ao08q8s%2e2u1l\">warning</a> of a scam involving online payroll systems. Criminals use social engineering to steal people&#8217;s credentials, and then divert direct deposits into accounts that they control. Sometimes they do other things to make it harder for the victim to realize what is happening.</p>\n<p>I feel like this kind of thing is happening everywhere, with everything. As we move more of our personal and professional lives online, we enable criminals to subvert the very systems we rely on.</p>\n",
    "content:encodedSnippet": "Microsoft is warning of a scam involving online payroll systems. Criminals use social engineering to steal people’s credentials, and then divert direct deposits into accounts that they control. Sometimes they do other things to make it harder for the victim to realize what is happening.\nI feel like this kind of thing is happening everywhere, with everything. As we move more of our personal and professional lives online, we enable criminals to subvert the very systems we rely on.",
    "dc:creator": "Bruce Schneier",
    "comments": "https://www.schneier.com/blog/archives/2025/11/cybercriminals-targeting-payroll-sites.html#comments",
    "content": "<p>Microsoft is <a href=\"https://thehackernews.com/2025/10/microsoft-warns-of-payroll-pirates.html?_m=3n%2e009a%2e3796%2ebx0ao08q8s%2e2u1l\">warning</a> of a scam involving online payroll systems. Criminals use social engineering to steal people&#8217;s credentials, and then divert direct deposits into accounts that they control. Sometimes they do other things to make it harder for the victim to realize what is happening.</p>\n<p>I feel like this kind of thing is happening everywhere, with everything. As we move more of our personal and professional lives online, we enable criminals to subvert the very systems we rely on.</p>\n",
    "contentSnippet": "Microsoft is warning of a scam involving online payroll systems. Criminals use social engineering to steal people’s credentials, and then divert direct deposits into accounts that they control. Sometimes they do other things to make it harder for the victim to realize what is happening.\nI feel like this kind of thing is happening everywhere, with everything. As we move more of our personal and professional lives online, we enable criminals to subvert the very systems we rely on.",
    "guid": "https://www.schneier.com/?p=71056",
    "categories": [
      "Uncategorized",
      "banking",
      "credentials",
      "scams",
      "social engineering"
    ],
    "isoDate": "2025-11-04T12:05:54.000Z"
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "Ransomware Defense Using the Wazuh Open Source Platform",
    "link": "https://thehackernews.com/2025/11/ransomware-defense-using-wazuh-open.html",
    "pubDate": "Tue, 04 Nov 2025 16:36:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhdzDGtHe9Q6e_Oawv8H4Le3i69OhWMTiJwqvdjqsp8o8oZ8gpy7R6cbsTzjncXVNJjI59pr2NENW0IycFha_hD92mziRlVuh_QhAeVo4mtyyz3iwUzD-e5UH6heYCAZGY3pwMJoWctM63QCiZAQe02F0r8KLU0_AkeGS4zxi9g-N5qiT4f5v15nJTMvFk/s1600/wazuh.jpg"
    },
    "content": "Ransomware is malicious software designed to block access to a computer system or encrypt data until a ransom is paid. This cyberattack is one of the most prevalent and damaging threats in the digital landscape, affecting individuals, businesses, and critical infrastructure worldwide.\nA ransomware attack typically begins when the malware infiltrates a system through various vectors such as",
    "contentSnippet": "Ransomware is malicious software designed to block access to a computer system or encrypt data until a ransom is paid. This cyberattack is one of the most prevalent and damaging threats in the digital landscape, affecting individuals, businesses, and critical infrastructure worldwide.\nA ransomware attack typically begins when the malware infiltrates a system through various vectors such as",
    "guid": "https://thehackernews.com/2025/11/ransomware-defense-using-wazuh-open.html",
    "isoDate": "2025-11-04T11:06:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "Operation SkyCloak Deploys Tor-Enabled OpenSSH Backdoor Targeting Defense Sectors",
    "link": "https://thehackernews.com/2025/11/operation-skycloak-deploys-tor-enabled.html",
    "pubDate": "Tue, 04 Nov 2025 16:19:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj6ok6aAygeqft712J7YEd_aBpjlL3SNlIraKZ2za1SW5EEy9HaK6k9fvrr-9WQVO3mbummfoqwbXUg-gbcXAYakGZTCjG3B1q6ur-9JEDP-krL8iq2nv53HY-DTSWSQEdQf1VO2S0msbO2Jj5ict0EjSES6j7nPpgX1Qz5nnN540Gy5EAiwBxidEff3gWe/s1600/russian.jpg"
    },
    "content": "Threat actors are leveraging weaponized attachments distributed via phishing emails to deliver malware likely targeting the defense sector in Russia and Belarus.\nAccording to multiple reports from Cyble and Seqrite Labs, the campaign is designed to deploy a persistent backdoor on compromised hosts that uses OpenSSH in conjunction with a customized Tor hidden service that employs obfs4 for",
    "contentSnippet": "Threat actors are leveraging weaponized attachments distributed via phishing emails to deliver malware likely targeting the defense sector in Russia and Belarus.\nAccording to multiple reports from Cyble and Seqrite Labs, the campaign is designed to deploy a persistent backdoor on compromised hosts that uses OpenSSH in conjunction with a customized Tor hidden service that employs obfs4 for",
    "guid": "https://thehackernews.com/2025/11/operation-skycloak-deploys-tor-enabled.html",
    "isoDate": "2025-11-04T10:49:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "Google’s AI ‘Big Sleep’ Finds 5 New Vulnerabilities in Apple’s Safari WebKit",
    "link": "https://thehackernews.com/2025/11/googles-ai-big-sleep-finds-5-new.html",
    "pubDate": "Tue, 04 Nov 2025 13:40:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgO90ZGqS1o8oXuQSYe44zmCBkNPE4eZDZy-NJhnRyFZ_ePcN4Tv-OOIuBKoi5Dnp0bN_HpCcxpAgMNYs6t0rCntWspx1JNRJSBbMsvzxDnSXewOvLDls6VU47KVeRxxDO4fHBO7_Ow6P9T3crzMpcwQxBofwQLcX0WKBIQYsHY64MDoazdGW_9ehXK7sXv/s1600/safari-flaw-ai.jpg"
    },
    "content": "Google's artificial intelligence (AI)-powered cybersecurity agent called Big Sleep has been credited by Apple for discovering as many as five different security flaws in the WebKit component used in its Safari web browser that, if successfully exploited, could result in a browser crash or memory corruption.\nThe list of vulnerabilities is as follows -\n\nCVE-2025-43429 - A buffer overflow",
    "contentSnippet": "Google's artificial intelligence (AI)-powered cybersecurity agent called Big Sleep has been credited by Apple for discovering as many as five different security flaws in the WebKit component used in its Safari web browser that, if successfully exploited, could result in a browser crash or memory corruption.\nThe list of vulnerabilities is as follows -\n\nCVE-2025-43429 - A buffer overflow",
    "guid": "https://thehackernews.com/2025/11/googles-ai-big-sleep-finds-5-new.html",
    "isoDate": "2025-11-04T08:10:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "U.S. Prosecutors Indict Cybersecurity Insiders Accused of BlackCat Ransomware Attacks",
    "link": "https://thehackernews.com/2025/11/us-prosecutors-indict-cybersecurity.html",
    "pubDate": "Tue, 04 Nov 2025 13:15:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg9mH0dvGWLCUJm63XD3luQR8ZpHCGiO_stcfyerR37pGHWLvFLC_CiXJ7j6TTTyxIJFx30P0YP2oXxFtMgAZTSfbNd7vL6Vy0lQ6ZR7wAfZIXZbND_xLM5yeejoG_uf-jhr_Wi9UZaSEvhR7XQ0ZcgZRxLQMRT1e8fvt5eVLMkX1l71OHc0jUwiDr1EnhZ/s1600/insider-ransomware.jpg"
    },
    "content": "Federal prosecutors in the U.S. have accused a trio of allegedly hacking the networks of five U.S. companies with BlackCat (aka ALPHV) ransomware between May and November 2023 and extorting them.\nRyan Clifford Goldberg, Kevin Tyler Martin, and an unnamed co–conspirator (aka \"Co-Conspirator 1\") based in Florida, all U.S. nationals, are said to have used the ransomware strain against a medical",
    "contentSnippet": "Federal prosecutors in the U.S. have accused a trio of allegedly hacking the networks of five U.S. companies with BlackCat (aka ALPHV) ransomware between May and November 2023 and extorting them.\nRyan Clifford Goldberg, Kevin Tyler Martin, and an unnamed co–conspirator (aka \"Co-Conspirator 1\") based in Florida, all U.S. nationals, are said to have used the ransomware strain against a medical",
    "guid": "https://thehackernews.com/2025/11/us-prosecutors-indict-cybersecurity.html",
    "isoDate": "2025-11-04T07:45:00.000Z",
    "itunes": {}
  }
]