[
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "Ransomware's Fragmentation Reaches a Breaking Point While LockBit Returns",
    "link": "https://thehackernews.com/2025/11/ransomwares-fragmentation-reaches.html",
    "pubDate": "Fri, 14 Nov 2025 16:07:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg3uOnzefv5B2kTQp_6TWvGzdYVbKeSKfysA_sFwHY_ZwrX14JYItv8p8x1NQwG5wOyRqJT0oaAWfGM0VWHZrsRa0ULtSxxfEAFoMkbd4hFmx7X7K_nWXbF6XaK4PRp2I0Daue7934YaCR1II5aR0H1Ah7kWkW2Izqy4m30VUvtA30a9N1yVuKcSRuGOlk/s1600/main-cover.jpg"
    },
    "content": "Key Takeaways:\n\n85 active ransomware and extortion groups observed in Q3 2025, reflecting the most decentralized ransomware ecosystem to date.\n1,590 victims disclosed across 85 leak sites, showing high, sustained activity despite law-enforcement pressure.\n14 new ransomware brands launched this quarter, proving how quickly affiliates reconstitute after takedowns.\nLockBit’s reappearance with",
    "contentSnippet": "Key Takeaways:\n\n85 active ransomware and extortion groups observed in Q3 2025, reflecting the most decentralized ransomware ecosystem to date.\n1,590 victims disclosed across 85 leak sites, showing high, sustained activity despite law-enforcement pressure.\n14 new ransomware brands launched this quarter, proving how quickly affiliates reconstitute after takedowns.\nLockBit’s reappearance with",
    "guid": "https://thehackernews.com/2025/11/ransomwares-fragmentation-reaches.html",
    "isoDate": "2025-11-14T10:37:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "Chinese Hackers Use Anthropic's AI to Launch Automated Cyber Espionage Campaign",
    "link": "https://thehackernews.com/2025/11/chinese-hackers-use-anthropics-ai-to.html",
    "pubDate": "Fri, 14 Nov 2025 15:23:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgY97QHdgW3A2yfeWB2UxuJM7ifkyjOUt1JChYPaaZbJS5U-bM9KXmk6rhlQ1jzoNZVVBURL6dkmPqi-ysMBfttQo-LLngJy-fQV6bpTQe6o9TcDy2Qsy8GhhUsSQ4ZV7_a6yjc9vcMl7g7EJI1YNNei1lKxzC3jg3UPvyJCYmgCdW9HjyTU7_VubEBAv0X/s1600/ai-hacking.jpg"
    },
    "content": "State-sponsored threat actors from China used artificial intelligence (AI) technology developed by Anthropic to orchestrate automated cyber attacks as part of a \"highly sophisticated espionage campaign\" in mid-September 2025.\n\"The attackers used AI's 'agentic' capabilities to an unprecedented degree – using AI not just as an advisor, but to execute the cyber attacks themselves,\" the AI upstart",
    "contentSnippet": "State-sponsored threat actors from China used artificial intelligence (AI) technology developed by Anthropic to orchestrate automated cyber attacks as part of a \"highly sophisticated espionage campaign\" in mid-September 2025.\n\"The attackers used AI's 'agentic' capabilities to an unprecedented degree – using AI not just as an advisor, but to execute the cyber attacks themselves,\" the AI upstart",
    "guid": "https://thehackernews.com/2025/11/chinese-hackers-use-anthropics-ai-to.html",
    "isoDate": "2025-11-14T09:53:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "Now-Patched Fortinet FortiWeb Flaw Exploited in Attacks to Create Admin Accounts",
    "link": "https://thehackernews.com/2025/11/fortinet-fortiweb-flaw-actively.html",
    "pubDate": "Fri, 14 Nov 2025 14:30:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh9W9UTKHr6MEohKLcpKi93cht-_Dh-uEOu4ga5ezZqlce29RSPo1X2cnCAUQijihCPVHaENo8Gz4jfDjcxHd3Gqe6_kqOt3Ff3-GikPzHA6pL-y_JFxlmuMxnRJKakGFfkOgBj7jW23nPrOKj0cz4BwGwbPICUA_ezilNl9UREzSuEixqNnukzxx0q0Aks/s1600/Fortinet-FortiWeb.jpg"
    },
    "content": "Cybersecurity researchers are sounding the alert about an authentication bypass vulnerability in Fortinet Fortiweb WAF that could allow an attacker to take over admin accounts and completely compromise a device.\n\"The watchTowr team is seeing active, indiscriminate in-the-wild exploitation of what appears to be a silently patched vulnerability in Fortinet's FortiWeb product,\" Benjamin Harris,",
    "contentSnippet": "Cybersecurity researchers are sounding the alert about an authentication bypass vulnerability in Fortinet Fortiweb WAF that could allow an attacker to take over admin accounts and completely compromise a device.\n\"The watchTowr team is seeing active, indiscriminate in-the-wild exploitation of what appears to be a silently patched vulnerability in Fortinet's FortiWeb product,\" Benjamin Harris,",
    "guid": "https://thehackernews.com/2025/11/fortinet-fortiweb-flaw-actively.html",
    "isoDate": "2025-11-14T09:00:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "Russian Hackers Create 4,300 Fake Travel Sites to Steal Hotel Guests' Payment Data",
    "link": "https://thehackernews.com/2025/11/russian-hackers-create-4300-fake-travel.html",
    "pubDate": "Fri, 14 Nov 2025 01:57:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjNhnn_FN1YzknlukZNSETlpsGEWJunJd8RntQwlE18t1lnZfUv4tbHe_CJkkLPVlZsRTU3_mz2Tfc1hsiCwmm2o-WcAz5zlXQqja_tPqI9__l8xz7MZDJC3rqW17VKFA3sy5v5Vyjd5UuqiytOPADhVEW7ZtFU2Uw7GobK91GhWnm7Bei_mTBMhLs83TQW/s1600/travel-sites.jpg"
    },
    "content": "A Russian-speaking threat behind an ongoing, mass phishing campaign has registered more than 4,300 domain names since the start of the year.\nThe activity, per Netcraft security researcher Andrew Brandt, is designed to target customers of the hospitality industry, specifically hotel guests who may have travel reservations with spam emails. The campaign is said to have begun in earnest around",
    "contentSnippet": "A Russian-speaking threat behind an ongoing, mass phishing campaign has registered more than 4,300 domain names since the start of the year.\nThe activity, per Netcraft security researcher Andrew Brandt, is designed to target customers of the hospitality industry, specifically hotel guests who may have travel reservations with spam emails. The campaign is said to have begun in earnest around",
    "guid": "https://thehackernews.com/2025/11/russian-hackers-create-4300-fake-travel.html",
    "isoDate": "2025-11-13T20:27:00.000Z",
    "itunes": {}
  },
  {
    "creator": "BrianKrebs",
    "title": "Google Sues to Disrupt Chinese SMS Phishing Triad",
    "link": "https://krebsonsecurity.com/2025/11/google-sues-to-disrupt-chinese-sms-phishing-triad/",
    "pubDate": "Thu, 13 Nov 2025 14:47:22 +0000",
    "content:encoded": "<p><strong>Google</strong> is suing more than two dozen unnamed individuals allegedly involved in peddling a popular China-based mobile phishing service that helps scammers impersonate hundreds of trusted brands, blast out text message lures, and convert phished payment card data into mobile wallets from Apple and Google.</p>\n<p>In <a href=\"https://www.courtlistener.com/docket/71900274/1/google-llc-v-does-1-25/\" target=\"_blank\" rel=\"noopener\">a lawsuit</a> filed in the Southern District of New York on November 12, Google sued to unmask and disrupt 25 &#8220;John Doe&#8221; defendants allegedly linked to the sale of <strong>Lighthouse</strong>, a sophisticated phishing kit that makes it simple for even novices to steal payment card data from mobile users. Google said Lighthouse has harmed more than a million victims across 120 countries.</p>\n<div id=\"attachment_70098\" style=\"width: 625px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-70098\" decoding=\"async\" class=\" wp-image-70098\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/01/lighthouse-tollroads.png\" alt=\"\" width=\"615\" height=\"852\" /><p id=\"caption-attachment-70098\" class=\"wp-caption-text\">A component of the Chinese phishing kit Lighthouse made to target customers of The Toll Roads, which refers to several state routes through Orange County, Calif.</p></div>\n<p>Lighthouse is one of several prolific phishing-as-a-service operations known as the &#8220;<strong>Smishing Triad</strong>,&#8221; and collectively they are responsible for sending <a href=\"https://krebsonsecurity.com/2025/01/chinese-innovations-spawn-wave-of-toll-phishing-via-sms/\" target=\"_blank\" rel=\"noopener\">millions of text messages that spoof the U.S. Postal Service</a> to supposedly collect some outstanding delivery fee, or that pretend to be a local toll road operator warning of a delinquent toll fee. More recently, Lighthouse has been used to spoof e-commerce websites, <a href=\"https://krebsonsecurity.com/2025/04/china-based-sms-phishing-triad-pivots-to-banks/\" target=\"_blank\" rel=\"noopener\">financial institutions</a> and<a href=\"https://krebsonsecurity.com/2025/08/mobile-phishers-target-brokerage-accounts-in-ramp-and-dump-cashout-scheme/\" target=\"_blank\" rel=\"noopener\"> brokerage firms</a>.</p>\n<p>Regardless of the text message lure used or brand used, the basic scam remains the same: After the visitor enters their payment information, the phishing site will automatically attempt to enroll the card as a mobile wallet from Apple or Google. The phishing site then tells the visitor that their bank is going to verify the transaction by sending a one-time code that needs to be entered into the payment page before the transaction can be completed.</p>\n<p>If the recipient provides that one-time code, the scammers can <a href=\"https://krebsonsecurity.com/2025/02/how-phished-data-turns-into-apple-google-wallets/\" target=\"_blank\" rel=\"noopener\">link the victim&#8217;s card data to a mobile wallet</a> on a device that they control. Researchers say the fraudsters usually load several stolen wallets onto each mobile device, and wait 7-10 days after that enrollment before selling the phones or using them for fraud.</p>\n<p>Google called the scale of the Lighthouse phishing attacks &#8220;staggering.&#8221; A <a href=\"https://www.silentpush.com/blog/smishing-triad/\" target=\"_blank\" rel=\"noopener\">May 2025 report</a> from <strong>Silent Push</strong> found the domains used by the Smishing Triad are rotated frequently, with approximately 25,000 phishing domains active during any 8-day period.</p>\n<p>Google&#8217;s lawsuit alleges the purveyors of Lighthouse violated the company&#8217;s trademarks by including Google&#8217;s logos on countless phishing websites. The complaint says Lighthouse offers over 600 templates for phishing websites of more than 400 entities, and that Google&#8217;s logos were featured on at least a quarter of those templates.</p>\n<p>Google is also pursuing Lighthouse under the <a href=\"https://en.wikipedia.org/wiki/Racketeer_Influenced_and_Corrupt_Organizations_Act\" target=\"_blank\" rel=\"noopener\">Racketeer Influenced and Corrupt Organizations (RICO) Act</a>, saying the Lighthouse phishing enterprise encompasses several connected threat actor groups that work together to design and implement complex criminal schemes targeting the general public.</p>\n<p>According to Google, those threat actor teams include a &#8220;<strong>developer group</strong>&#8221; that supplies the phishing software and templates; a &#8220;<strong>data broker group</strong>&#8221; that provides a list of targets; a &#8220;<strong>spammer group</strong>&#8221; that provides the tools to send fraudulent text messages in volume; a &#8220;<strong>theft group</strong>,&#8221; in charge of monetizing the phished information; and an &#8220;<strong>administrative group</strong>,&#8221; which runs their Telegram support channels and discussion groups designed to facilitate collaboration and recruit new members.</p>\n<p>&#8220;While different members of the Enterprise may play different roles in the Schemes, they all collaborate to execute phishing attacks that rely on the Lighthouse software,&#8221; Google&#8217;s complaint alleges. &#8220;None of the Enterprise’s Schemes can generate revenue without collaboration and cooperation among the members of the Enterprise. All of the threat actor groups are connected to one another through historical and current business ties, including through their use of Lighthouse and the online community supporting its use, which exists on both YouTube and Telegram channels.&#8221;</p>\n<p>Silent Push&#8217;s May report observed that the Smishing Triad boasts it has &#8220;300+ front desk staff worldwide&#8221; involved in Lighthouse, staff that is mainly used to support various aspects of the group’s fraud and cash-out schemes.</p>\n<div id=\"attachment_70435\" style=\"width: 659px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-70435\" decoding=\"async\" loading=\"lazy\" class=\" wp-image-70435\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/02/phonesashtray.png\" alt=\"\" width=\"649\" height=\"862\" /><p id=\"caption-attachment-70435\" class=\"wp-caption-text\">An image shared by an SMS phishing group shows a panel of mobile phones responsible for mass-sending phishing messages. These panels require a live operator because the one-time codes being shared by phishing victims must be used quickly as they generally expire within a few minutes.</p></div>\n<p><span id=\"more-72607\"></span></p>\n<p>Google alleges that in addition to blasting out text messages spoofing known brands, Lighthouse makes it easy for customers to mass-create fake e-commerce websites that are advertised using Google Ads accounts (and paid for with stolen credit cards). These phony merchants collect payment card information at checkout, and then prompt the customer to expect and share a one-time code sent from their financial institution.</p>\n<p>Once again, that one-time code is being sent by the bank because the fake e-commerce site has just attempted to enroll the victim&#8217;s payment card data in a mobile wallet. By the time a victim understands they will likely never receive the item they just purchased from the fake e-commerce shop, the scammers have already run through hundreds of dollars in fraudulent charges, often at high-end electronics stores or jewelers.</p>\n<p><strong>Ford Merrill</strong> works in security research at <a href=\"https://www.secalliance.com/\" target=\"_blank\" rel=\"noopener\">SecAlliance</a>, a <a href=\"https://www.csis.com/\" target=\"_blank\" rel=\"noopener\">CSIS Security Group</a> company, and he&#8217;s been tracking Chinese SMS phishing groups for several years. Merrill said many Lighthouse customers are now using the phishing kit to erect fake e-commerce websites that are advertised on Google and Meta platforms.</p>\n<p>&#8220;You find this shop by searching for a particular product online or whatever, and you think you&#8217;re getting a good deal,&#8221; Merrill said. &#8220;But of course you never receive the product, and they will phish that one-time code at checkout.&#8221;</p>\n<p>Merrill said some of the phishing templates include payment buttons for services like <strong>PayPal</strong>, and that victims who choose to pay through PayPal can also see their PayPal accounts hijacked.</p>\n<div id=\"attachment_70946\" style=\"width: 733px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-70946\" decoding=\"async\" loading=\"lazy\" class=\"size-full wp-image-70946\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/04/paypalsmish.png\" alt=\"\" width=\"723\" height=\"512\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2025/04/paypalsmish.png 723w, https://krebsonsecurity.com/wp-content/uploads/2025/04/paypalsmish-100x70.png 100w\" sizes=\"(max-width: 723px) 100vw, 723px\" /><p id=\"caption-attachment-70946\" class=\"wp-caption-text\">A fake e-commerce site from the Smishing Triad spoofing PayPal on a mobile device.</p></div>\n<p>&#8220;The main advantage of the fake e-commerce site is that it doesn&#8217;t require them to send out message lures,&#8221; Merrill said, noting that the fake vendor sites have more staying power than traditional phishing sites because it takes far longer for them to be flagged for fraud.</p>\n<p>Merrill said Google&#8217;s legal action may temporarily disrupt the Lighthouse operators, and could make it easier for U.S. federal authorities to bring criminal charges against the group. But he said the Chinese mobile phishing market is so lucrative right now that it&#8217;s difficult to imagine a popular phishing service voluntarily turning out the lights.</p>\n<p>Merrill said Google&#8217;s lawsuit also can help lay the groundwork for future disruptive actions against Lighthouse and other phishing-as-a-service entities that are operating almost entirely on Chinese networks. According to Silent Push, a majority of the phishing sites created with these kits are sitting at two Chinese hosting companies: <strong>Tencent</strong> (AS132203) and <strong>Alibaba</strong> (AS45102).</p>\n<p>&#8220;Once Google has a default judgment against the Lighthouse guys in court, theoretically they could use that to go to Alibaba and Tencent and say, &#8216;These guys have been found guilty, here are their domains and IP addresses, we want you to shut these down or we&#8217;ll include you in the case.'&#8221;</p>\n<p>If Google can bring that kind of legal pressure consistently over time, Merrill said, they might succeed in increasing costs for the phishers and more frequently disrupting their operations.</p>\n<p>&#8220;If you take all of these Chinese phishing kit developers, I have to believe it&#8217;s tens of thousands of Chinese-speaking people involved,&#8221; he said. &#8220;The Lighthouse guys will probably burn down their Telegram channels and disappear for a while. They might call it something else or redevelop their service entirely. But I don&#8217;t believe for a minute they&#8217;re going to close up shop and leave forever.&#8221;</p>\n",
    "content:encodedSnippet": "Google is suing more than two dozen unnamed individuals allegedly involved in peddling a popular China-based mobile phishing service that helps scammers impersonate hundreds of trusted brands, blast out text message lures, and convert phished payment card data into mobile wallets from Apple and Google.\nIn a lawsuit filed in the Southern District of New York on November 12, Google sued to unmask and disrupt 25 “John Doe” defendants allegedly linked to the sale of Lighthouse, a sophisticated phishing kit that makes it simple for even novices to steal payment card data from mobile users. Google said Lighthouse has harmed more than a million victims across 120 countries.\n\nA component of the Chinese phishing kit Lighthouse made to target customers of The Toll Roads, which refers to several state routes through Orange County, Calif.\n\nLighthouse is one of several prolific phishing-as-a-service operations known as the “Smishing Triad,” and collectively they are responsible for sending millions of text messages that spoof the U.S. Postal Service to supposedly collect some outstanding delivery fee, or that pretend to be a local toll road operator warning of a delinquent toll fee. More recently, Lighthouse has been used to spoof e-commerce websites, financial institutions and brokerage firms.\nRegardless of the text message lure used or brand used, the basic scam remains the same: After the visitor enters their payment information, the phishing site will automatically attempt to enroll the card as a mobile wallet from Apple or Google. The phishing site then tells the visitor that their bank is going to verify the transaction by sending a one-time code that needs to be entered into the payment page before the transaction can be completed.\nIf the recipient provides that one-time code, the scammers can link the victim’s card data to a mobile wallet on a device that they control. Researchers say the fraudsters usually load several stolen wallets onto each mobile device, and wait 7-10 days after that enrollment before selling the phones or using them for fraud.\nGoogle called the scale of the Lighthouse phishing attacks “staggering.” A May 2025 report from Silent Push found the domains used by the Smishing Triad are rotated frequently, with approximately 25,000 phishing domains active during any 8-day period.\nGoogle’s lawsuit alleges the purveyors of Lighthouse violated the company’s trademarks by including Google’s logos on countless phishing websites. The complaint says Lighthouse offers over 600 templates for phishing websites of more than 400 entities, and that Google’s logos were featured on at least a quarter of those templates.\nGoogle is also pursuing Lighthouse under the Racketeer Influenced and Corrupt Organizations (RICO) Act, saying the Lighthouse phishing enterprise encompasses several connected threat actor groups that work together to design and implement complex criminal schemes targeting the general public.\nAccording to Google, those threat actor teams include a “developer group” that supplies the phishing software and templates; a “data broker group” that provides a list of targets; a “spammer group” that provides the tools to send fraudulent text messages in volume; a “theft group,” in charge of monetizing the phished information; and an “administrative group,” which runs their Telegram support channels and discussion groups designed to facilitate collaboration and recruit new members.\n“While different members of the Enterprise may play different roles in the Schemes, they all collaborate to execute phishing attacks that rely on the Lighthouse software,” Google’s complaint alleges. “None of the Enterprise’s Schemes can generate revenue without collaboration and cooperation among the members of the Enterprise. All of the threat actor groups are connected to one another through historical and current business ties, including through their use of Lighthouse and the online community supporting its use, which exists on both YouTube and Telegram channels.”\nSilent Push’s May report observed that the Smishing Triad boasts it has “300+ front desk staff worldwide” involved in Lighthouse, staff that is mainly used to support various aspects of the group’s fraud and cash-out schemes.\n\nAn image shared by an SMS phishing group shows a panel of mobile phones responsible for mass-sending phishing messages. These panels require a live operator because the one-time codes being shared by phishing victims must be used quickly as they generally expire within a few minutes.\n\n\nGoogle alleges that in addition to blasting out text messages spoofing known brands, Lighthouse makes it easy for customers to mass-create fake e-commerce websites that are advertised using Google Ads accounts (and paid for with stolen credit cards). These phony merchants collect payment card information at checkout, and then prompt the customer to expect and share a one-time code sent from their financial institution.\nOnce again, that one-time code is being sent by the bank because the fake e-commerce site has just attempted to enroll the victim’s payment card data in a mobile wallet. By the time a victim understands they will likely never receive the item they just purchased from the fake e-commerce shop, the scammers have already run through hundreds of dollars in fraudulent charges, often at high-end electronics stores or jewelers.\nFord Merrill works in security research at SecAlliance, a CSIS Security Group company, and he’s been tracking Chinese SMS phishing groups for several years. Merrill said many Lighthouse customers are now using the phishing kit to erect fake e-commerce websites that are advertised on Google and Meta platforms.\n“You find this shop by searching for a particular product online or whatever, and you think you’re getting a good deal,” Merrill said. “But of course you never receive the product, and they will phish that one-time code at checkout.”\nMerrill said some of the phishing templates include payment buttons for services like PayPal, and that victims who choose to pay through PayPal can also see their PayPal accounts hijacked.\n\nA fake e-commerce site from the Smishing Triad spoofing PayPal on a mobile device.\n\n“The main advantage of the fake e-commerce site is that it doesn’t require them to send out message lures,” Merrill said, noting that the fake vendor sites have more staying power than traditional phishing sites because it takes far longer for them to be flagged for fraud.\nMerrill said Google’s legal action may temporarily disrupt the Lighthouse operators, and could make it easier for U.S. federal authorities to bring criminal charges against the group. But he said the Chinese mobile phishing market is so lucrative right now that it’s difficult to imagine a popular phishing service voluntarily turning out the lights.\nMerrill said Google’s lawsuit also can help lay the groundwork for future disruptive actions against Lighthouse and other phishing-as-a-service entities that are operating almost entirely on Chinese networks. According to Silent Push, a majority of the phishing sites created with these kits are sitting at two Chinese hosting companies: Tencent (AS132203) and Alibaba (AS45102).\n“Once Google has a default judgment against the Lighthouse guys in court, theoretically they could use that to go to Alibaba and Tencent and say, ‘These guys have been found guilty, here are their domains and IP addresses, we want you to shut these down or we’ll include you in the case.'”\nIf Google can bring that kind of legal pressure consistently over time, Merrill said, they might succeed in increasing costs for the phishers and more frequently disrupting their operations.\n“If you take all of these Chinese phishing kit developers, I have to believe it’s tens of thousands of Chinese-speaking people involved,” he said. “The Lighthouse guys will probably burn down their Telegram channels and disappear for a while. They might call it something else or redevelop their service entirely. But I don’t believe for a minute they’re going to close up shop and leave forever.”",
    "dc:creator": "BrianKrebs",
    "comments": "https://krebsonsecurity.com/2025/11/google-sues-to-disrupt-chinese-sms-phishing-triad/#comments",
    "content": "Google is suing more than two dozen unnamed individuals allegedly involved in peddling a popular China-based mobile phishing service that helps scammers impersonate hundreds of trusted brands, blast out text message lures, and convert phished payment card data into mobile wallets from Apple and Google.",
    "contentSnippet": "Google is suing more than two dozen unnamed individuals allegedly involved in peddling a popular China-based mobile phishing service that helps scammers impersonate hundreds of trusted brands, blast out text message lures, and convert phished payment card data into mobile wallets from Apple and Google.",
    "guid": "https://krebsonsecurity.com/?p=72607",
    "categories": [
      "A Little Sunshine",
      "The Coming Storm",
      "Web Fraud 2.0",
      "Alibaba",
      "apple",
      "CSIS Security Group",
      "Ford Merrill",
      "google",
      "Lighthouse",
      "mobile phishing",
      "Racketeer Influenced and Corrupt Organizations (RICO) Act",
      "SecAlliance",
      "Silent Push",
      "Smishing Triad",
      "Tencent"
    ],
    "isoDate": "2025-11-13T14:47:22.000Z"
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "Fake Chrome Extension “Safery” Steals Ethereum Wallet Seed Phrases Using Sui Blockchain",
    "link": "https://thehackernews.com/2025/11/fake-chrome-extension-safery-steals.html",
    "pubDate": "Thu, 13 Nov 2025 18:34:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhS-Kf6dnTbbnxktKjoq7yOuQcEZ5eAObBOOXkT5cPRRC_UZGyfDnQOrZA8yiAE-fn6mXRgzOiWxB7uFr2ofyOnoUIWRW9geQttVX95HTIeAiU2sS4osiKQiWxKIWeJcc0oKw84MabuSF0i59NpUq0YB3uIHp7OsSRDAZQFnIhjENG6xSjX6BxlDDZkMbYw/s1600/chrome-eth.png"
    },
    "content": "Cybersecurity researchers have uncovered a malicious Chrome extension that poses as a legitimate Ethereum wallet but harbors functionality to exfiltrate users' seed phrases.\nThe name of the extension is \"Safery: Ethereum Wallet,\" with the threat actor describing it as a \"secure wallet for managing Ethereum cryptocurrency with flexible settings.\" It was uploaded to the Chrome Web Store on",
    "contentSnippet": "Cybersecurity researchers have uncovered a malicious Chrome extension that poses as a legitimate Ethereum wallet but harbors functionality to exfiltrate users' seed phrases.\nThe name of the extension is \"Safery: Ethereum Wallet,\" with the threat actor describing it as a \"secure wallet for managing Ethereum cryptocurrency with flexible settings.\" It was uploaded to the Chrome Web Store on",
    "guid": "https://thehackernews.com/2025/11/fake-chrome-extension-safery-steals.html",
    "isoDate": "2025-11-13T13:04:00.000Z",
    "itunes": {}
  },
  {
    "creator": "Bruce Schneier",
    "title": "Book Review: The Business of Secrets",
    "link": "https://www.schneier.com/blog/archives/2025/11/book-review-the-business-of-secrets.html",
    "pubDate": "Thu, 13 Nov 2025 12:09:39 +0000",
    "content:encoded": "<p><strong>The Business of Secrets: Adventures in Selling Encryption Around the World by Fred Kinch (May 24, 2024)</strong></p>\n<p>From the vantage point of today, it&#8217;s surreal reading about the commercial cryptography business in the 1970s. Nobody knew anything. The manufacturers didn&#8217;t know whether the cryptography they sold was any good. The customers didn&#8217;t know whether the crypto they bought was any good. Everyone pretended to know, thought they knew, or knew better than to even try to know.</p>\n<p>The Business of Secrets is the self-published memoirs of Fred Kinch. He was founder and vice president of&#8212;mostly sales&#8212;at a US cryptographic hardware company called Datotek, from company&#8217;s founding in 1969 until 1982. It&#8217;s mostly a disjointed collection of stories about the difficulties of selling to governments worldwide, along with descriptions of the highs and (mostly) lows of foreign airlines, foreign hotels, and foreign travel in general. But it&#8217;s also about encryption.</p>\n<p>Datotek sold cryptographic equipment in the era after rotor machines and before modern academic cryptography. The company initially marketed computer-file encryption, but pivoted to link encryption &#8211; low-speed data, voice, fax &#8211; because that&#8217;s what the market wanted.</p>\n<p>These were the years where the NSA hired anyone promising in the field, and routinely classified &#8211; and thereby blocked &#8211; publication of academic mathematics papers of those they didn&#8217;t hire. They controlled the fielding of strong cryptography by aggressively using the International Traffic in Arms regulation. Kinch talks about the difficulties in getting an expert license for Datotek&#8217;s products; he didn&#8217;t know that the only reason he ever got that license was because the NSA was able to break his company&#8217;s stuff. He had no idea that his largest competitor, the Swiss company Crypto AG, was owned and controlled by the CIA and its West German equivalent. &#8220;Wouldn&#8217;t that have made our life easier if we had known that back in the 1970s?&#8221; Yes, it would. But no one knew.</p>\n<p>Glimmers of the clandestine world peek out of the book. Countries like France ask detailed tech questions, borrow or buy a couple of units for &#8220;evaluation,&#8221; and then disappear again. Did they break the encryption? Did they just want to see what their adversaries were using? No one at Datotek knew.</p>\n<p>Kinch &#8220;carried the key generator logic diagrams and schematics&#8221; with him &#8211; even today it&#8217;s good practice not to rely on their secrecy for security&#8212;but the details seem laughably insecure: four linear shift registers of 29, 23, 13, and 7 bits, variable stepping, and a small nonlinear final transformation. The NSA probably used this as a challenge to its new hires. But Datotek didn&#8217;t know that, at the time.</p>\n<p>Kinch writes: &#8220;The strength of the cryptography had to be accepted on trust and only on trust.&#8221; Yes, but it&#8217;s so, so weird to read about it in practice. Kinch demonstrated the security of his telephone encryptors by hooking a pair of them up and having people listen to the encrypted voice. It&#8217;s rather like demonstrating the safety of a food additive by showing that someone doesn&#8217;t immediately fall over dead after eating it. (In one absolutely bizarre anecdote, an Argentine sergeant with a &#8220;hearing defect&#8221; could understand the scrambled analog voice. Datotek fixed its security, but only offered the upgrade to the Argentines, because no one else complained. As I said, no one knew anything.)</p>\n<p>In his postscript, he writes that even if the NSA could break Datotek&#8217;s products, they were &#8220;vastly superior to what [his customers] had used previously.&#8221; Given that the previous devices were electromechanical rotor machines, and that his primary competition was a CIA-run operation, he&#8217;s probably right. But even today, we know nothing about any other country&#8217;s cryptanalytic capabilities during those decades.</p>\n<p>A lot of this book has a &#8220;you had to be there&#8221; vibe. And it&#8217;s mostly tone-deaf. There is no real acknowledgment of the human-rights-abusing countries on Datotek&#8217;s customer list, and how their products might have assisted those governments. But it&#8217;s a fascinating artifact of an era before commercial cryptography went mainstream, before academic cryptography became approved for US classified data, before those of us outside the triple fences of the NSA understood the mathematics of cryptography.</p>\n<p><em>This book review originally appeared in <a href=\"https://www.afio.com/book-reviews/\">AFIO</a>.</em></p>\n",
    "content:encodedSnippet": "The Business of Secrets: Adventures in Selling Encryption Around the World by Fred Kinch (May 24, 2024)\nFrom the vantage point of today, it’s surreal reading about the commercial cryptography business in the 1970s. Nobody knew anything. The manufacturers didn’t know whether the cryptography they sold was any good. The customers didn’t know whether the crypto they bought was any good. Everyone pretended to know, thought they knew, or knew better than to even try to know.\nThe Business of Secrets is the self-published memoirs of Fred Kinch. He was founder and vice president of—mostly sales—at a US cryptographic hardware company called Datotek, from company’s founding in 1969 until 1982. It’s mostly a disjointed collection of stories about the difficulties of selling to governments worldwide, along with descriptions of the highs and (mostly) lows of foreign airlines, foreign hotels, and foreign travel in general. But it’s also about encryption.\nDatotek sold cryptographic equipment in the era after rotor machines and before modern academic cryptography. The company initially marketed computer-file encryption, but pivoted to link encryption – low-speed data, voice, fax – because that’s what the market wanted.\nThese were the years where the NSA hired anyone promising in the field, and routinely classified – and thereby blocked – publication of academic mathematics papers of those they didn’t hire. They controlled the fielding of strong cryptography by aggressively using the International Traffic in Arms regulation. Kinch talks about the difficulties in getting an expert license for Datotek’s products; he didn’t know that the only reason he ever got that license was because the NSA was able to break his company’s stuff. He had no idea that his largest competitor, the Swiss company Crypto AG, was owned and controlled by the CIA and its West German equivalent. “Wouldn’t that have made our life easier if we had known that back in the 1970s?” Yes, it would. But no one knew.\nGlimmers of the clandestine world peek out of the book. Countries like France ask detailed tech questions, borrow or buy a couple of units for “evaluation,” and then disappear again. Did they break the encryption? Did they just want to see what their adversaries were using? No one at Datotek knew.\nKinch “carried the key generator logic diagrams and schematics” with him – even today it’s good practice not to rely on their secrecy for security—but the details seem laughably insecure: four linear shift registers of 29, 23, 13, and 7 bits, variable stepping, and a small nonlinear final transformation. The NSA probably used this as a challenge to its new hires. But Datotek didn’t know that, at the time.\nKinch writes: “The strength of the cryptography had to be accepted on trust and only on trust.” Yes, but it’s so, so weird to read about it in practice. Kinch demonstrated the security of his telephone encryptors by hooking a pair of them up and having people listen to the encrypted voice. It’s rather like demonstrating the safety of a food additive by showing that someone doesn’t immediately fall over dead after eating it. (In one absolutely bizarre anecdote, an Argentine sergeant with a “hearing defect” could understand the scrambled analog voice. Datotek fixed its security, but only offered the upgrade to the Argentines, because no one else complained. As I said, no one knew anything.)\nIn his postscript, he writes that even if the NSA could break Datotek’s products, they were “vastly superior to what [his customers] had used previously.” Given that the previous devices were electromechanical rotor machines, and that his primary competition was a CIA-run operation, he’s probably right. But even today, we know nothing about any other country’s cryptanalytic capabilities during those decades.\nA lot of this book has a “you had to be there” vibe. And it’s mostly tone-deaf. There is no real acknowledgment of the human-rights-abusing countries on Datotek’s customer list, and how their products might have assisted those governments. But it’s a fascinating artifact of an era before commercial cryptography went mainstream, before academic cryptography became approved for US classified data, before those of us outside the triple fences of the NSA understood the mathematics of cryptography.\nThis book review originally appeared in AFIO.",
    "dc:creator": "Bruce Schneier",
    "comments": "https://www.schneier.com/blog/archives/2025/11/book-review-the-business-of-secrets.html#comments",
    "content": "<p><strong>The Business of Secrets: Adventures in Selling Encryption Around the World by Fred Kinch (May 24, 2024)</strong></p>\n<p>From the vantage point of today, it&#8217;s surreal reading about the commercial cryptography business in the 1970s. Nobody knew anything. The manufacturers didn&#8217;t know whether the cryptography they sold was any good. The customers didn&#8217;t know whether the crypto they bought was any good. Everyone pretended to know, thought they knew, or knew better than to even try to know.</p>\n<p>The Business of Secrets is the self-published memoirs of Fred Kinch. He was founder and vice president of&#8212;mostly sales&#8212;at a US cryptographic hardware company called Datotek, from company&#8217;s founding in 1969 until 1982. It&#8217;s mostly a disjointed collection of stories about the difficulties of selling to governments worldwide, along with descriptions of the highs and (mostly) lows of foreign airlines, foreign hotels, and foreign travel in general. But it&#8217;s also about encryption...</p>",
    "contentSnippet": "The Business of Secrets: Adventures in Selling Encryption Around the World by Fred Kinch (May 24, 2024)\nFrom the vantage point of today, it’s surreal reading about the commercial cryptography business in the 1970s. Nobody knew anything. The manufacturers didn’t know whether the cryptography they sold was any good. The customers didn’t know whether the crypto they bought was any good. Everyone pretended to know, thought they knew, or knew better than to even try to know.\nThe Business of Secrets is the self-published memoirs of Fred Kinch. He was founder and vice president of—mostly sales—at a US cryptographic hardware company called Datotek, from company’s founding in 1969 until 1982. It’s mostly a disjointed collection of stories about the difficulties of selling to governments worldwide, along with descriptions of the highs and (mostly) lows of foreign airlines, foreign hotels, and foreign travel in general. But it’s also about encryption...",
    "guid": "https://www.schneier.com/?p=71134",
    "categories": [
      "Uncategorized",
      "business of security",
      "cryptography",
      "encryption",
      "history of cryptography"
    ],
    "isoDate": "2025-11-13T12:09:39.000Z"
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "When Attacks Come Faster Than Patches: Why 2026 Will be the Year of Machine-Speed Security",
    "link": "https://thehackernews.com/2025/11/when-attacks-come-faster-than-patches.html",
    "pubDate": "Thu, 13 Nov 2025 17:00:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEifX_sGMzSUW1AUV_08r1UPZTqpZXXvAv6Th97yAF1ja5P66mnLefkfQZapkXuvk0LIjdD312TqcZ3DX_ZSnMRjA3FbJSUKNSH1CcjhoGJqfwe7q6ImqOiSTKvZRNNptcqkij0KS_U-k1FmZETxV5DiQlxNjSfAwNvpcvbvrjBgsfbpGiFSt2ePmvEzGgk/s1600/MAIN-action.jpg"
    },
    "content": "The Race for Every New CVE\nBased on multiple 2025 industry reports: roughly 50 to 61 percent of newly disclosed vulnerabilities saw exploit code weaponized within 48 hours. Using the CISA Known Exploited Vulnerabilities Catalog as a reference, hundreds of software flaws are now confirmed as actively targeted within days of public disclosure. Each new announcement now triggers a global race",
    "contentSnippet": "The Race for Every New CVE\nBased on multiple 2025 industry reports: roughly 50 to 61 percent of newly disclosed vulnerabilities saw exploit code weaponized within 48 hours. Using the CISA Known Exploited Vulnerabilities Catalog as a reference, hundreds of software flaws are now confirmed as actively targeted within days of public disclosure. Each new announcement now triggers a global race",
    "guid": "https://thehackernews.com/2025/11/when-attacks-come-faster-than-patches.html",
    "isoDate": "2025-11-13T11:30:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "Operation Endgame Dismantles Rhadamanthys, Venom RAT, and Elysium Botnet in Global Crackdown",
    "link": "https://thehackernews.com/2025/11/operation-endgame-dismantles.html",
    "pubDate": "Thu, 13 Nov 2025 16:46:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjY00oEG13hfnasBGraI20sE4zXV_Scyf9TwtpMtBdvk4u_OOeWIaCeiUXi-e-rBOypRqVbQP4ydMp9a95qu7LQiUv4Xt-mmGd5eJIWIFp9JGJaDGVyGbMxZ88SJLVfsw7bp2z_6QS0NHt-OL973LypZMemh_1B6kxKW0fycaGBBYU1DkMS9_0JP_0d_EKA/s1600/botnets.jpg"
    },
    "content": "Malware families like Rhadamanthys Stealer, Venom RAT, and the Elysium botnet have been disrupted as part of a coordinated law enforcement operation led by Europol and Eurojust.\nThe activity, which is taking place between November 10 and 13, 2025, marks the latest phase of Operation Endgame, an ongoing operation designed to take down criminal infrastructures and combat ransomware enablers",
    "contentSnippet": "Malware families like Rhadamanthys Stealer, Venom RAT, and the Elysium botnet have been disrupted as part of a coordinated law enforcement operation led by Europol and Eurojust.\nThe activity, which is taking place between November 10 and 13, 2025, marks the latest phase of Operation Endgame, an ongoing operation designed to take down criminal infrastructures and combat ransomware enablers",
    "guid": "https://thehackernews.com/2025/11/operation-endgame-dismantles.html",
    "isoDate": "2025-11-13T11:16:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "ThreatsDay Bulletin: Cisco 0-Days, AI Bug Bounties, Crypto Heists, State-Linked Leaks and 20 More Stories",
    "link": "https://thehackernews.com/2025/11/threatsday-bulletin-cisco-0-days-ai-bug.html",
    "pubDate": "Thu, 13 Nov 2025 15:40:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgjcN5gUiUl1dr7wmK15gRPjL2FiB6JcudmfA1-b8FM8m4MeOGl1jiAXwihlPQrYa1nbrs6eupd6Lk5h-XiGIybMkphWiNvv3uBC1eVewDUxQ-Z2WANldO93ilR2OyUlVvXpYMlFRs15S5A6CbDZtudGXbm6sl7gnob6FLPnmO2rAqHLlu9jUWCIuXWchV4/s1600/threatsday-cover.jpg"
    },
    "content": "Behind every click, there’s a risk waiting to be tested. A simple ad, email, or link can now hide something dangerous. Hackers are getting smarter, using new tools to sneak past filters and turn trusted systems against us.\nBut security teams are fighting back. They’re building faster defenses, better ways to spot attacks, and stronger systems to keep people safe. It’s a constant race — every",
    "contentSnippet": "Behind every click, there’s a risk waiting to be tested. A simple ad, email, or link can now hide something dangerous. Hackers are getting smarter, using new tools to sneak past filters and turn trusted systems against us.\nBut security teams are fighting back. They’re building faster defenses, better ways to spot attacks, and stronger systems to keep people safe. It’s a constant race — every",
    "guid": "https://thehackernews.com/2025/11/threatsday-bulletin-cisco-0-days-ai-bug.html",
    "isoDate": "2025-11-13T10:10:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "CISA Flags Critical WatchGuard Fireware Flaw Exposing 54,000 Fireboxes to No-Login Attacks",
    "link": "https://thehackernews.com/2025/11/cisa-flags-critical-watchguard-fireware.html",
    "pubDate": "Thu, 13 Nov 2025 12:53:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgPj6dtQtZKcXl4TjnJfg2t7WniTYLkQ1NLwaQzVB6A-EXj3b3kn6ZGSrAi4AkjkI2HcbdmEGePORP5d1Z7b2awdGjIQD9TCCOPr0YLUUjU4Bazi9LsKY3f0XNvp343duOjEucfDaZaOlkV3tMntsNHp5ilw6Uef2D6_tt2nl3pgbVkQXwH6edgVhUuD8SQ/s1600/firewall1.jpg"
    },
    "content": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Wednesday added a critical security flaw impacting WatchGuard Fireware to its Known Exploited Vulnerabilities (KEV) catalog, based on evidence of active exploitation.\nThe vulnerability in question is CVE-2025-9242 (CVSS score: 9.3), an out-of-bounds write vulnerability affecting Fireware OS 11.10.2 up to and including",
    "contentSnippet": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Wednesday added a critical security flaw impacting WatchGuard Fireware to its Known Exploited Vulnerabilities (KEV) catalog, based on evidence of active exploitation.\nThe vulnerability in question is CVE-2025-9242 (CVSS score: 9.3), an out-of-bounds write vulnerability affecting Fireware OS 11.10.2 up to and including",
    "guid": "https://thehackernews.com/2025/11/cisa-flags-critical-watchguard-fireware.html",
    "isoDate": "2025-11-13T07:23:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "Over 67,000 Fake npm Packages Flood Registry in Worm-Like Spam Attack",
    "link": "https://thehackernews.com/2025/11/over-46000-fake-npm-packages-flood.html",
    "pubDate": "Thu, 13 Nov 2025 10:28:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjYS26azmd2_hhOZvimLT0xZHe62lE9WVPNiqVvatrXANuYx-pkBp8n1v_eAPLoq4FmVbgv3ACPPlFk_BpqpGAVQ8X-yMGCWcuZjYocPiYlpJDhw6ITx-CXQzdJPF3FM6jbxrcRexNpyEzW4PDjzuLkjSRooPvCoLYaN56M5xWkSOqAIiYV1BetoeqLe1ZN/s1600/npms.jpg"
    },
    "content": "Cybersecurity researchers are calling attention to a large-scale spam campaign that has flooded the npm registry with thousands of fake packages since early 2024 as part of a likely financially motivated effort.\n\"The packages were systematically published over an extended period, flooding the npm registry with junk packages that survived in the ecosystem for almost two years,\" Endor Labs",
    "contentSnippet": "Cybersecurity researchers are calling attention to a large-scale spam campaign that has flooded the npm registry with thousands of fake packages since early 2024 as part of a likely financially motivated effort.\n\"The packages were systematically published over an extended period, flooding the npm registry with junk packages that survived in the ecosystem for almost two years,\" Endor Labs",
    "guid": "https://thehackernews.com/2025/11/over-46000-fake-npm-packages-flood.html",
    "isoDate": "2025-11-13T04:58:00.000Z",
    "itunes": {}
  },
  {
    "creator": "Dell Cameron",
    "title": "DHS Kept Chicago Police Records for Months in Violation of Domestic Espionage Rules",
    "link": "https://www.wired.com/story/dhs-kept-chicago-police-records-for-months-in-violation-of-domestic-espionage-rules/",
    "pubDate": "Wed, 12 Nov 2025 22:03:20 +0000",
    "dc:creator": "Dell Cameron",
    "content": "The Department of Homeland Security collected data on Chicago residents accused of gang ties to test if police files could feed an FBI watchlist. Months passed before anyone noticed it wasn’t deleted.",
    "contentSnippet": "The Department of Homeland Security collected data on Chicago residents accused of gang ties to test if police files could feed an FBI watchlist. Months passed before anyone noticed it wasn’t deleted.",
    "guid": "690cccd8b950b4a61e7c40e6",
    "categories": [
      "Security"
    ],
    "isoDate": "2025-11-12T22:03:20.000Z"
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "Google Sues China-Based Hackers Behind $1 Billion Lighthouse Phishing Platform",
    "link": "https://thehackernews.com/2025/11/google-sues-china-based-hackers-behind.html",
    "pubDate": "Wed, 12 Nov 2025 21:18:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj8QizRTvnh2FKfShLUyRGB3nG7j8gwkx9JSvsjDH6VcXmTi9PjdDOHeM-xRjC7uhftMQ097vBryvyFeF0z8tPOWqVEa9qU8vAJxXeppNmdDMAW4ISJScYLrYVS45803vYriSa6qDzZ2mhH0lq00WHCJQhvW7nFIVbYMrTns6Z8rC-yF68QEtar56NWcec1/s1600/google-phishing.jpg"
    },
    "content": "Google has filed a civil lawsuit in the U.S. District Court for the Southern District of New York (SDNY) against China-based hackers who are behind a massive Phishing-as-a-Service (PhaaS) platform called Lighthouse that has ensnared over 1 million users across 120 countries.\nThe PhaaS kit is used to conduct large-scale SMS phishing attacks that exploit trusted brands like E-ZPass and USPS to",
    "contentSnippet": "Google has filed a civil lawsuit in the U.S. District Court for the Southern District of New York (SDNY) against China-based hackers who are behind a massive Phishing-as-a-Service (PhaaS) platform called Lighthouse that has ensnared over 1 million users across 120 countries.\nThe PhaaS kit is used to conduct large-scale SMS phishing attacks that exploit trusted brands like E-ZPass and USPS to",
    "guid": "https://thehackernews.com/2025/11/google-sues-china-based-hackers-behind.html",
    "isoDate": "2025-11-12T15:48:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "Amazon Uncovers Attacks Exploited Cisco ISE and Citrix NetScaler as Zero-Day Flaws",
    "link": "https://thehackernews.com/2025/11/amazon-uncovers-attacks-exploited-cisco.html",
    "pubDate": "Wed, 12 Nov 2025 19:30:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh_sh7XL7mszgdfrNOO_BzjEXspnLIuY2VVyB1VWyIj36nuDhnUiEWJPiy2C7PaZ7Zdqb2DS_mG1NtIRRLpvNRFiPjUZDNKrQmYL9CjNsGZPPCfCK9NgsQiPrv8tvvO3Eb79uCpvdhrSAXcfCV2pwvj6QnUsVxItGQyAimmR5DukNp0aADLaV-UCH6NHRyT/s1600/cisco.jpg"
    },
    "content": "Amazon's threat intelligence team on Wednesday disclosed that it observed an advanced threat actor exploiting two then-zero-day security flaws in Cisco Identity Service Engine (ISE) and Citrix NetScaler ADC products as part of attacks designed to deliver custom malware.\n\"This discovery highlights the trend of threat actors focusing on critical identity and network access control infrastructure –",
    "contentSnippet": "Amazon's threat intelligence team on Wednesday disclosed that it observed an advanced threat actor exploiting two then-zero-day security flaws in Cisco Identity Service Engine (ISE) and Citrix NetScaler ADC products as part of attacks designed to deliver custom malware.\n\"This discovery highlights the trend of threat actors focusing on critical identity and network access control infrastructure –",
    "guid": "https://thehackernews.com/2025/11/amazon-uncovers-attacks-exploited-cisco.html",
    "isoDate": "2025-11-12T14:00:00.000Z",
    "itunes": {}
  },
  {
    "creator": "Bruce Schneier",
    "title": "On Hacking Back",
    "link": "https://www.schneier.com/blog/archives/2025/11/on-hacking-back.html",
    "pubDate": "Wed, 12 Nov 2025 12:01:53 +0000",
    "content:encoded": "<p>Former DoJ attorney John Carlin <a href=\"https://www.aspendigital.org/blog/so-you-want-to-hack-back/\">writes</a> about hackback, which he defines thus: &#8220;A hack back is a type of cyber response that incorporates a counterattack designed to proactively engage with, disable, or collect evidence about an attacker. Although hack backs can take on various forms, they are&#8212;­by definition­&#8212;not passive defensive measures.&#8221;</p>\n<p>His conclusion:</p>\n<blockquote><p>As the law currently stands, specific forms of purely defense measures are authorized so long as they affect only the victim’s system or data.</p>\n<p>At the other end of the spectrum, offensive measures that involve accessing or otherwise causing damage or loss to the hacker’s systems are likely prohibited, absent government oversight or authorization. And even then parties should proceed with caution in light of the heightened risks of misattribution, collateral damage, and retaliation.</p>\n<p>As for the broad range of other hack back tactics that fall in the middle of active defense and offensive measures, private parties should continue to engage in these tactics only with government oversight or authorization. These measures exist within a legal gray area and would likely benefit from amendments to the CFAA and CISA that clarify and carve out the parameters of authorization for specific self-defense measures. But in the absence of amendments or clarification on the scope of those laws, private actors can seek governmental authorization through an array of channels, whether they be partnering with law enforcement or seeking authorization to engage in more offensive tactics from the courts in connection with private litigation.</p></blockquote>\n",
    "content:encodedSnippet": "Former DoJ attorney John Carlin writes about hackback, which he defines thus: “A hack back is a type of cyber response that incorporates a counterattack designed to proactively engage with, disable, or collect evidence about an attacker. Although hack backs can take on various forms, they are—­by definition­—not passive defensive measures.”\nHis conclusion:\nAs the law currently stands, specific forms of purely defense measures are authorized so long as they affect only the victim’s system or data.\nAt the other end of the spectrum, offensive measures that involve accessing or otherwise causing damage or loss to the hacker’s systems are likely prohibited, absent government oversight or authorization. And even then parties should proceed with caution in light of the heightened risks of misattribution, collateral damage, and retaliation.\nAs for the broad range of other hack back tactics that fall in the middle of active defense and offensive measures, private parties should continue to engage in these tactics only with government oversight or authorization. These measures exist within a legal gray area and would likely benefit from amendments to the CFAA and CISA that clarify and carve out the parameters of authorization for specific self-defense measures. But in the absence of amendments or clarification on the scope of those laws, private actors can seek governmental authorization through an array of channels, whether they be partnering with law enforcement or seeking authorization to engage in more offensive tactics from the courts in connection with private litigation.",
    "dc:creator": "Bruce Schneier",
    "comments": "https://www.schneier.com/blog/archives/2025/11/on-hacking-back.html#comments",
    "content": "<p>Former DoJ attorney John Carlin <a href=\"https://www.aspendigital.org/blog/so-you-want-to-hack-back/\">writes</a> about hackback, which he defines thus: &#8220;A hack back is a type of cyber response that incorporates a counterattack designed to proactively engage with, disable, or collect evidence about an attacker. Although hack backs can take on various forms, they are&#8212;­by definition­&#8212;not passive defensive measures.&#8221;</p>\n<p>His conclusion:</p>\n<blockquote><p>As the law currently stands, specific forms of purely defense measures are authorized so long as they affect only the victim’s system or data.</p>\n<p>At the other end of the spectrum, offensive measures that involve accessing or otherwise causing damage or loss to the hacker’s systems are likely prohibited, absent government oversight or authorization. And even then parties should proceed with caution in light of the heightened risks of misattribution, collateral damage, and retaliation...</p></blockquote>",
    "contentSnippet": "Former DoJ attorney John Carlin writes about hackback, which he defines thus: “A hack back is a type of cyber response that incorporates a counterattack designed to proactively engage with, disable, or collect evidence about an attacker. Although hack backs can take on various forms, they are—­by definition­—not passive defensive measures.”\nHis conclusion:\nAs the law currently stands, specific forms of purely defense measures are authorized so long as they affect only the victim’s system or data.\nAt the other end of the spectrum, offensive measures that involve accessing or otherwise causing damage or loss to the hacker’s systems are likely prohibited, absent government oversight or authorization. And even then parties should proceed with caution in light of the heightened risks of misattribution, collateral damage, and retaliation...",
    "guid": "https://www.schneier.com/?p=71128",
    "categories": [
      "Uncategorized",
      "hackback",
      "laws"
    ],
    "isoDate": "2025-11-12T12:01:53.000Z"
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "[Webinar] Learn How Leading Security Teams Reduce Attack Surface Exposure with DASR",
    "link": "https://thehackernews.com/2025/11/webinar-learn-how-leading-security.html",
    "pubDate": "Wed, 12 Nov 2025 17:25:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjb7usGljMR3vSfxxk9XeKY39fUcIRMFDq6GOy0OEA_AK7P4ybAoHwl9Ga45OJ5pZPzpDhwqZ0D6PKEI-IFFifcl-NWBM5ymJ6wcNSyL3bneCMbRbVGz1ca3MIaKDHWbNvOVzK1LinCOt0RLYF1-zb_Zy11bGddkRxowymBu754CFJDpCDIreh4iiGF4loK/s1600/cyberteams.jpg"
    },
    "content": "Every day, security teams face the same problem—too many risks, too many alerts, and not enough time. You fix one issue, and three more show up. It feels like you’re always one step behind.\nBut what if there was a smarter way to stay ahead—without adding more work or stress?\nJoin The Hacker News and Bitdefender for a free cybersecurity webinar to learn about a new approach called Dynamic Attack",
    "contentSnippet": "Every day, security teams face the same problem—too many risks, too many alerts, and not enough time. You fix one issue, and three more show up. It feels like you’re always one step behind.\nBut what if there was a smarter way to stay ahead—without adding more work or stress?\nJoin The Hacker News and Bitdefender for a free cybersecurity webinar to learn about a new approach called Dynamic Attack",
    "guid": "https://thehackernews.com/2025/11/webinar-learn-how-leading-security.html",
    "isoDate": "2025-11-12T11:55:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "Active Directory Under Siege: Why Critical Infrastructure Needs Stronger Security",
    "link": "https://thehackernews.com/2025/11/active-directory-under-siege-why.html",
    "pubDate": "Wed, 12 Nov 2025 16:37:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgzohgVmJwL0IMF6xUDk-7UKhnswaBtnht8YAdjmMgnPeft_d_PwFL5ZFvm9zfO_pKg-RkmHgwEM9Uyj6lr5GnUB_Y4IM2oDsroi0pC1yYS6-zdbpiGX-gIlpFQwmBgy-4TcXvQ3NtTXheeqFVh6DL9RUjug2QhaFGFZJOtiJdPOkC1jkZWBuJIJsIHwS0/s1600/MAIN.jpg"
    },
    "content": "Active Directory remains the authentication backbone for&nbsp;over 90% of Fortune 1000 companies. AD's importance has grown as companies adopt hybrid and cloud infrastructure, but so has its complexity. Every application, user, and device traces back to AD for authentication and authorization, making it the ultimate target. For attackers, it represents the holy grail: compromise Active",
    "contentSnippet": "Active Directory remains the authentication backbone for over 90% of Fortune 1000 companies. AD's importance has grown as companies adopt hybrid and cloud infrastructure, but so has its complexity. Every application, user, and device traces back to AD for authentication and authorization, making it the ultimate target. For attackers, it represents the holy grail: compromise Active",
    "guid": "https://thehackernews.com/2025/11/active-directory-under-siege-why.html",
    "isoDate": "2025-11-12T11:07:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "Microsoft Fixes 63 Security Flaws, Including a Windows Kernel Zero-Day Under Active Attack",
    "link": "https://thehackernews.com/2025/11/microsoft-fixes-63-security-flaws.html",
    "pubDate": "Wed, 12 Nov 2025 15:51:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiUYsGcLHyK_kqDIY7BFmCJ4AE9H52XJOIWUJqYcOSdx0Zd3mSRUt1Z0obn3VXzWTbrZGysPwxK7Hte4CKCobzIee0kXOVOfhyphenhyphenKZhfI-jiDss_R1mNucatfeU0nklQI3kZDiQfzPpVIsgmZj9s4hXbNhP3XzR2ibeHdBezB6w1j_CTt3FrrOQgmse3pdpPX/s1600/windows-update.jpg"
    },
    "content": "Microsoft on Tuesday released patches for 63 new security vulnerabilities identified in its software, including one that has come under active exploitation in the wild.\nOf the 63 flaws, four are rated Critical and 59 are rated Important in severity. Twenty-nine of these vulnerabilities are related to privilege escalation, followed by 16 remote code execution, 11 information disclosure, three",
    "contentSnippet": "Microsoft on Tuesday released patches for 63 new security vulnerabilities identified in its software, including one that has come under active exploitation in the wild.\nOf the 63 flaws, four are rated Critical and 59 are rated Important in severity. Twenty-nine of these vulnerabilities are related to privilege escalation, followed by 16 remote code execution, 11 information disclosure, three",
    "guid": "https://thehackernews.com/2025/11/microsoft-fixes-63-security-flaws.html",
    "isoDate": "2025-11-12T10:21:00.000Z",
    "itunes": {}
  },
  {
    "creator": "Matt Burgess",
    "title": "This Is the Platform Google Claims Is Behind a 'Staggering’ Scam Text Operation",
    "link": "https://www.wired.com/story/lighthouse-google-lawsuit-scam-text-messages/",
    "pubDate": "Wed, 12 Nov 2025 10:00:00 +0000",
    "dc:creator": "Matt Burgess",
    "content": "Google is suing 25 people it alleges are behind a “relentless” scam text operation that uses a phishing-as-a-service platform called Lighthouse.",
    "contentSnippet": "Google is suing 25 people it alleges are behind a “relentless” scam text operation that uses a phishing-as-a-service platform called Lighthouse.",
    "guid": "691346949e5a9ce509c067de",
    "categories": [
      "Security",
      "Security / Security News"
    ],
    "isoDate": "2025-11-12T10:00:00.000Z"
  }
]