[
  {
    "creator": "BrianKrebs",
    "title": "Alleged Jabber Zeus Coder ‘MrICQ’ in U.S. Custody",
    "link": "https://krebsonsecurity.com/2025/11/alleged-jabber-zeus-coder-mricq-in-u-s-custody/",
    "pubDate": "Sun, 02 Nov 2025 20:37:24 +0000",
    "content:encoded": "<p>A Ukrainian man indicted in 2012 for conspiring with a prolific hacking group to steal tens of millions of dollars from U.S. businesses was arrested in Italy and is now in custody in the United States, KrebsOnSecurity has learned.</p>\n<p>Sources close to the investigation say <strong>Yuriy Igorevich Rybtsov</strong>, a 41-year-old from the Russia-controlled city of Donetsk, Ukraine, was previously referenced in U.S. federal charging documents only by his online handle &#8220;<strong>MrICQ</strong>.&#8221; According to <a href=\"https://www.justice.gov/iso/opa/resources/2162014411104532407242.pdf\" target=\"_blank\" rel=\"noopener\">a 13-year-old indictment</a> (PDF) filed by prosecutors in Nebraska, MrICQ was a developer for a cybercrime group known as &#8220;<strong>Jabber Zeus</strong>.&#8221;</p>\n<div id=\"attachment_72498\" style=\"width: 759px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-72498\" decoding=\"async\" class=\" wp-image-72498\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/11/rybtsov-lockedup.png\" alt=\"\" width=\"749\" height=\"678\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2025/11/rybtsov-lockedup.png 861w, https://krebsonsecurity.com/wp-content/uploads/2025/11/rybtsov-lockedup-768x695.png 768w, https://krebsonsecurity.com/wp-content/uploads/2025/11/rybtsov-lockedup-782x708.png 782w\" sizes=\"(max-width: 749px) 100vw, 749px\" /><p id=\"caption-attachment-72498\" class=\"wp-caption-text\">Image: lockedup dot wtf.</p></div>\n<p>The Jabber Zeus name is derived from the malware they used &#8212; a custom version of the <a href=\"https://krebsonsecurity.com/?s=zeus+trojan\" target=\"_blank\" rel=\"noopener\">ZeuS banking trojan</a> &#8212; that stole banking login credentials and would send the group a Jabber instant message each time a new victim entered a one-time passcode at a financial institution website. The gang targeted mostly small to mid-sized businesses, and they were an early pioneer of so-called &#8220;man-in-the-browser&#8221; attacks, malware that can silently intercept any data that victims submit in a web-based form.</p>\n<p>Once inside a victim company&#8217;s accounts, the Jabber Zeus crew would modify the firm&#8217;s payroll to add dozens of &#8220;money mules,&#8221; people recruited through elaborate work-at-home schemes to handle bank transfers. The mules in turn would forward any stolen payroll deposits — minus their commissions — via wire transfers to other mules in Ukraine and the United Kingdom.</p>\n<p>The 2012 indictment targeting the Jabber Zeus crew named MrICQ as &#8220;<strong>John Doe #3</strong>,&#8221; and said this person handled incoming notifications of newly compromised victims. The Department of Justice (DOJ) said MrICQ also helped the group launder the proceeds of their heists through electronic currency exchange services.</p>\n<p>Two sources familiar with the Jabber Zeus investigation said Rybtsov was arrested in Italy, although the exact date and circumstances of his arrest remain unclear. A <a href=\"https://www.cortedicassazione.it/resources/cms/documents/Rassegna_mensile_MAGGIO_2025__settore_penale.pdf\" target=\"_blank\" rel=\"noopener\">summary of recent decisions</a> (PDF) published by the Italian Supreme Court states that in April 2025, Rybtsov lost a final appeal to avoid extradition to the United States.</p>\n<p>According to the mugshot website <strong>lockedup[.]wtf</strong>, Rybtsov arrived in Nebraska on October 9, and was being held under an arrest warrant from the <strong>U.S. Federal Bureau of Investigation</strong> (FBI).</p>\n<p>The data breach tracking service <a href=\"https://constella.ai\" target=\"_blank\" rel=\"noopener\">Constella Intelligence</a> found breached records from the business profiling site bvdinfo[.]com showing that a 41-year-old Yuriy Igorevich Rybtsov worked in a building at 59 Barnaulska St. in Donetsk. Further searching on this address in Constella finds the same apartment building was shared by a business registered to <strong>Vyacheslav “Tank” Penchukov</strong>, the leader of the Jabber Zeus crew in Ukraine.</p>\n<div id=\"attachment_61804\" style=\"width: 753px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-61804\" decoding=\"async\" loading=\"lazy\" class=\" wp-image-61804\" src=\"https://krebsonsecurity.com/wp-content/uploads/2022/11/tank-dj.png\" alt=\"\" width=\"743\" height=\"587\" /><p id=\"caption-attachment-61804\" class=\"wp-caption-text\">Vyacheslav “Tank” Penchukov, seen here performing as &#8220;DJ Slava Rich&#8221; in Ukraine, in an undated photo from social media.</p></div>\n<p>Penchukov was <a href=\"https://krebsonsecurity.com/2022/11/top-zeus-botnet-suspect-tank-arrested-in-geneva/\" target=\"_blank\" rel=\"noopener\">arrested in 2022</a> while traveling to meet his wife in Switzerland. Last year, a federal court in Nebraska <a href=\"https://www.wired.com/story/vyacheslav-igorevich-penchukov-tank-zeus-malware-sentencing/\" target=\"_blank\" rel=\"noopener\">sentenced Penchukov to 18 years in prison</a> and ordered him to pay more than $73 million in restitution.<span id=\"more-72496\"></span></p>\n<p><strong>Lawrence Baldwin</strong> is founder of <a href=\"https://mynetwatchman.com\" target=\"_blank\" rel=\"noopener\">myNetWatchman</a>, a threat intelligence company based in Georgia that began tracking and disrupting the Jabber Zeus gang in 2009. myNetWatchman had secretly gained access to the Jabber chat server used by the Ukrainian hackers, allowing Baldwin to eavesdrop on the daily conversations between MrICQ and other Jabber Zeus members.</p>\n<p>Baldwin shared those real-time chat records with multiple state and federal law enforcement agencies, and with this reporter. Between 2010 and 2013, I spent several hours each day alerting small businesses across the country that their payroll accounts were about to be drained by these cybercriminals.</p>\n<p>Those notifications, and Baldwin&#8217;s tireless efforts, saved countless would-be victims a great deal of money. In most cases, however, we were already too late. Nevertheless, the pilfered Jabber Zeus group chats provided the basis for dozens of stories published here about <a href=\"https://krebsonsecurity.com/category/smallbizvictims/\" target=\"_blank\" rel=\"noopener\">small businesses fighting their banks</a> in court over six- and seven-figure financial losses.</p>\n<p>Baldwin said the Jabber Zeus crew was far ahead of its peers in several respects. For starters, their intercepted chats showed they worked to create a highly customized botnet directly with the author of the original Zeus Trojan &#8212; <strong>Evgeniy Mikhailovich Bogachev</strong>, a Russian man who has long been on the FBI&#8217;s &#8220;Most Wanted&#8221; list. The feds have a <a href=\"https://krebsonsecurity.com/2015/02/fbi-3m-bounty-for-zeus-trojan-author/\" target=\"_blank\" rel=\"noopener\">standing $3 million reward</a> for information leading to Bogachev&#8217;s arrest.</p>\n<div id=\"attachment_49974\" style=\"width: 753px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-49974\" decoding=\"async\" loading=\"lazy\" class=\"size-full wp-image-49974\" src=\"https://krebsonsecurity.com/wp-content/uploads/2019/12/bogachev.png\" alt=\"\" width=\"743\" height=\"456\" /><p id=\"caption-attachment-49974\" class=\"wp-caption-text\">Evgeniy M. Bogachev, in undated photos.</p></div>\n<p>The core innovation of Jabber Zeus was an alert that MrICQ would receive each time a new victim entered a one-time password code into a phishing page mimicking their financial institution. The gang&#8217;s internal name for this component was &#8220;<strong>Leprechaun</strong>,&#8221; (the <a href=\"https://www.youtube.com/watch?v=UiAg3puABeA\" target=\"_blank\" rel=\"noopener\">video below</a> from myNetWatchman shows it in action). Jabber Zeus would actually re-write the HTML code as displayed in the victim&#8217;s browser, allowing them to intercept any passcodes sent by the victim&#8217;s bank for multi-factor authentication.</p>\n<p>&#8220;These guys had compromised such a large number of victims that they were getting buried in a tsunami of stolen banking credentials,&#8221; Baldwin told KrebsOnSecurity. &#8220;But the whole point of Leprechaun was to isolate the highest-value credentials &#8212; the commercial bank accounts with two-factor authentication turned on. They knew these were far juicier targets because they clearly had a lot more money to protect.&#8221;</p>\n<p><iframe loading=\"lazy\" title=\"YouTube video player\" src=\"https://www.youtube.com/embed/UiAg3puABeA?si=pEHck5AXQ5mBKhz9\" width=\"740\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>Baldwin said the Jabber Zeus trojan also included a custom &#8220;backconnect&#8221; component that allowed the hackers to relay their bank account takeovers through the victim&#8217;s own infected PC.</p>\n<p>&#8220;The Jabber Zeus crew were literally connecting to the victim&#8217;s bank account from the victim&#8217;s IP address, or from the remote control function and by fully emulating the device,&#8221; he said. &#8220;That trojan was like a hot knife through butter of what everyone thought was state-of-the-art secure online banking at the time.&#8221;</p>\n<p>Although the Jabber Zeus crew was in direct contact with the Zeus author, the chats intercepted by myNetWatchman show Bogachev frequently ignored the group&#8217;s pleas for help. The government says the real leader of the Jabber Zeus crew was <strong>Maksim Yakubets</strong>, a 38-year Ukrainian man with Russian citizenship who went by the hacker handle &#8220;<strong>Aqua</strong>.&#8221;</p>\n<div id=\"attachment_49935\" style=\"width: 760px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-49935\" decoding=\"async\" loading=\"lazy\" class=\" wp-image-49935\" src=\"https://krebsonsecurity.com/wp-content/uploads/2019/12/yukabets.png\" alt=\"\" width=\"750\" height=\"611\" /><p id=\"caption-attachment-49935\" class=\"wp-caption-text\">Alleged Evil Corp leader Maksim &#8220;Aqua&#8221; Yakubets. Image: FBI</p></div>\n<p>The Jabber chats intercepted by Baldwin show that Aqua interacted almost daily with MrICQ, Tank and other members of the hacking team, often facilitating the group&#8217;s money mule and cashout activities remotely from Russia.</p>\n<p>The government says Yakubets/Aqua would later emerge as the leader of an elite cybercrime ring of at least 17 hackers that referred to themselves internally as &#8220;<strong>Evil Corp</strong>.&#8221; Members of Evil Corp developed and used the <strong>Dridex</strong> (a.k.a. <strong>Bugat</strong>) trojan, which helped them siphon more than $100 million from hundreds of victim companies in the United States and Europe.</p>\n<p><a href=\"https://krebsonsecurity.com/2019/12/inside-evil-corp-a-100m-cybercrime-menace/\" target=\"_blank\" rel=\"noopener\">This 2019 story about the government&#8217;s $5 million bounty</a> for information leading to Yakubets&#8217;s arrest includes excerpts of conversations between Aqua, Tank, Bogachev and other Jabber Zeus crew members discussing stories I&#8217;d written about their victims. Both Baldwin and I were interviewed at length for a new weekly six-part podcast by the <strong>BBC</strong> that delves deep into the history of Evil Corp. <a href=\"https://www.bbc.com/audio/play/w3ct89y8\" target=\"_blank\" rel=\"noopener\">Episode One</a> focuses on the evolution of Zeus, while <a href=\"https://www.bbc.com/audio/play/w3ct89y9\" target=\"_blank\" rel=\"noopener\">the second episode</a> centers on an investigation into the group by former FBI agent <strong>Jim Craig</strong>.</p>\n<div id=\"attachment_72504\" style=\"width: 757px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-72504\" decoding=\"async\" loading=\"lazy\" class=\" wp-image-72504\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/11/bbc-cyberhack.png\" alt=\"\" width=\"747\" height=\"423\" /><p id=\"caption-attachment-72504\" class=\"wp-caption-text\">Image: https://www.bbc.co.uk/programmes/w3ct89y8</p></div>\n",
    "content:encodedSnippet": "A Ukrainian man indicted in 2012 for conspiring with a prolific hacking group to steal tens of millions of dollars from U.S. businesses was arrested in Italy and is now in custody in the United States, KrebsOnSecurity has learned.\nSources close to the investigation say Yuriy Igorevich Rybtsov, a 41-year-old from the Russia-controlled city of Donetsk, Ukraine, was previously referenced in U.S. federal charging documents only by his online handle “MrICQ.” According to a 13-year-old indictment (PDF) filed by prosecutors in Nebraska, MrICQ was a developer for a cybercrime group known as “Jabber Zeus.”\n\nImage: lockedup dot wtf.\n\nThe Jabber Zeus name is derived from the malware they used — a custom version of the ZeuS banking trojan — that stole banking login credentials and would send the group a Jabber instant message each time a new victim entered a one-time passcode at a financial institution website. The gang targeted mostly small to mid-sized businesses, and they were an early pioneer of so-called “man-in-the-browser” attacks, malware that can silently intercept any data that victims submit in a web-based form.\nOnce inside a victim company’s accounts, the Jabber Zeus crew would modify the firm’s payroll to add dozens of “money mules,” people recruited through elaborate work-at-home schemes to handle bank transfers. The mules in turn would forward any stolen payroll deposits — minus their commissions — via wire transfers to other mules in Ukraine and the United Kingdom.\nThe 2012 indictment targeting the Jabber Zeus crew named MrICQ as “John Doe #3,” and said this person handled incoming notifications of newly compromised victims. The Department of Justice (DOJ) said MrICQ also helped the group launder the proceeds of their heists through electronic currency exchange services.\nTwo sources familiar with the Jabber Zeus investigation said Rybtsov was arrested in Italy, although the exact date and circumstances of his arrest remain unclear. A summary of recent decisions (PDF) published by the Italian Supreme Court states that in April 2025, Rybtsov lost a final appeal to avoid extradition to the United States.\nAccording to the mugshot website lockedup[.]wtf, Rybtsov arrived in Nebraska on October 9, and was being held under an arrest warrant from the U.S. Federal Bureau of Investigation (FBI).\nThe data breach tracking service Constella Intelligence found breached records from the business profiling site bvdinfo[.]com showing that a 41-year-old Yuriy Igorevich Rybtsov worked in a building at 59 Barnaulska St. in Donetsk. Further searching on this address in Constella finds the same apartment building was shared by a business registered to Vyacheslav “Tank” Penchukov, the leader of the Jabber Zeus crew in Ukraine.\n\nVyacheslav “Tank” Penchukov, seen here performing as “DJ Slava Rich” in Ukraine, in an undated photo from social media.\n\nPenchukov was arrested in 2022 while traveling to meet his wife in Switzerland. Last year, a federal court in Nebraska sentenced Penchukov to 18 years in prison and ordered him to pay more than $73 million in restitution.\nLawrence Baldwin is founder of myNetWatchman, a threat intelligence company based in Georgia that began tracking and disrupting the Jabber Zeus gang in 2009. myNetWatchman had secretly gained access to the Jabber chat server used by the Ukrainian hackers, allowing Baldwin to eavesdrop on the daily conversations between MrICQ and other Jabber Zeus members.\nBaldwin shared those real-time chat records with multiple state and federal law enforcement agencies, and with this reporter. Between 2010 and 2013, I spent several hours each day alerting small businesses across the country that their payroll accounts were about to be drained by these cybercriminals.\nThose notifications, and Baldwin’s tireless efforts, saved countless would-be victims a great deal of money. In most cases, however, we were already too late. Nevertheless, the pilfered Jabber Zeus group chats provided the basis for dozens of stories published here about small businesses fighting their banks in court over six- and seven-figure financial losses.\nBaldwin said the Jabber Zeus crew was far ahead of its peers in several respects. For starters, their intercepted chats showed they worked to create a highly customized botnet directly with the author of the original Zeus Trojan — Evgeniy Mikhailovich Bogachev, a Russian man who has long been on the FBI’s “Most Wanted” list. The feds have a standing $3 million reward for information leading to Bogachev’s arrest.\n\nEvgeniy M. Bogachev, in undated photos.\n\nThe core innovation of Jabber Zeus was an alert that MrICQ would receive each time a new victim entered a one-time password code into a phishing page mimicking their financial institution. The gang’s internal name for this component was “Leprechaun,” (the video below from myNetWatchman shows it in action). Jabber Zeus would actually re-write the HTML code as displayed in the victim’s browser, allowing them to intercept any passcodes sent by the victim’s bank for multi-factor authentication.\n“These guys had compromised such a large number of victims that they were getting buried in a tsunami of stolen banking credentials,” Baldwin told KrebsOnSecurity. “But the whole point of Leprechaun was to isolate the highest-value credentials — the commercial bank accounts with two-factor authentication turned on. They knew these were far juicier targets because they clearly had a lot more money to protect.”\n\nBaldwin said the Jabber Zeus trojan also included a custom “backconnect” component that allowed the hackers to relay their bank account takeovers through the victim’s own infected PC.\n“The Jabber Zeus crew were literally connecting to the victim’s bank account from the victim’s IP address, or from the remote control function and by fully emulating the device,” he said. “That trojan was like a hot knife through butter of what everyone thought was state-of-the-art secure online banking at the time.”\nAlthough the Jabber Zeus crew was in direct contact with the Zeus author, the chats intercepted by myNetWatchman show Bogachev frequently ignored the group’s pleas for help. The government says the real leader of the Jabber Zeus crew was Maksim Yakubets, a 38-year Ukrainian man with Russian citizenship who went by the hacker handle “Aqua.”\n\nAlleged Evil Corp leader Maksim “Aqua” Yakubets. Image: FBI\n\nThe Jabber chats intercepted by Baldwin show that Aqua interacted almost daily with MrICQ, Tank and other members of the hacking team, often facilitating the group’s money mule and cashout activities remotely from Russia.\nThe government says Yakubets/Aqua would later emerge as the leader of an elite cybercrime ring of at least 17 hackers that referred to themselves internally as “Evil Corp.” Members of Evil Corp developed and used the Dridex (a.k.a. Bugat) trojan, which helped them siphon more than $100 million from hundreds of victim companies in the United States and Europe.\nThis 2019 story about the government’s $5 million bounty for information leading to Yakubets’s arrest includes excerpts of conversations between Aqua, Tank, Bogachev and other Jabber Zeus crew members discussing stories I’d written about their victims. Both Baldwin and I were interviewed at length for a new weekly six-part podcast by the BBC that delves deep into the history of Evil Corp. Episode One focuses on the evolution of Zeus, while the second episode centers on an investigation into the group by former FBI agent Jim Craig.\n\nImage: https://www.bbc.co.uk/programmes/w3ct89y8",
    "dc:creator": "BrianKrebs",
    "comments": "https://krebsonsecurity.com/2025/11/alleged-jabber-zeus-coder-mricq-in-u-s-custody/#comments",
    "content": "A Ukrainian man indicted in 2012 for conspiring with a prolific hacking group to steal tens of millions of dollars from U.S. businesses was arrested in Italy and is now in custody in the United States, KrebsOnSecurity has learned.\r\n\r\nSources close to the investigation say Yuriy Igorevich Rybtsov, a 41-year-old from the Russia-controlled city of Donetsk, Ukraine, was previously referenced in U.S. federal charging documents only by his online handle \"MrICQ.\" According to a 13-year-old indictment filed by prosecutors in Nebraska, MrICQ was a developer for a cybercrime group known as \"Jabber Zeus.\"",
    "contentSnippet": "A Ukrainian man indicted in 2012 for conspiring with a prolific hacking group to steal tens of millions of dollars from U.S. businesses was arrested in Italy and is now in custody in the United States, KrebsOnSecurity has learned.\r\n\r\nSources close to the investigation say Yuriy Igorevich Rybtsov, a 41-year-old from the Russia-controlled city of Donetsk, Ukraine, was previously referenced in U.S. federal charging documents only by his online handle \"MrICQ.\" According to a 13-year-old indictment filed by prosecutors in Nebraska, MrICQ was a developer for a cybercrime group known as \"Jabber Zeus.\"",
    "guid": "https://krebsonsecurity.com/?p=72496",
    "categories": [
      "A Little Sunshine",
      "Ne'er-Do-Well News",
      "Target: Small Businesses",
      "aqua",
      "BBC",
      "Bugat",
      "Dridex",
      "Evgeniy Mikhailovich Bogachev",
      "Evil Corp.",
      "Federal Bureau of Investigation",
      "Jabber Zeus",
      "Jim Craig",
      "Lawrence Baldwin",
      "Leprechaun",
      "Maksim Yakubets",
      "MrICQ",
      "U.S. Department of Justice",
      "vyacheslav \"tank\" penchukov",
      "Yuriy Igorevich Rybtsov",
      "ZeuS Trojan"
    ],
    "isoDate": "2025-11-02T20:37:24.000Z"
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "ASD Warns of Ongoing BADCANDY Attacks Exploiting Cisco IOS XE Vulnerability",
    "link": "https://thehackernews.com/2025/11/asd-warns-of-ongoing-badcandy-attacks.html",
    "pubDate": "Sat, 01 Nov 2025 19:13:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEivjJxC82aGCds7xQg0mAqxFwkMrJCO3JdIyu5ShCl2QYOrnrJpOdBSnJdlnN1euQiL6blI-sBypwPP-nCcWSrkvxZkNGsH1yb9zE7bgLKXOpwFvit66JlEtekICCBuPxgMY6uYJaWAMyXYmAvvdsrdjoV6qzVdSyPUjzS332wVtMWxg4AaF2DTiYrfmQQM/s1600/cisco.jpg"
    },
    "content": "The Australian Signals Directorate (ASD) has issued a bulletin about ongoing cyber attacks targeting unpatched Cisco IOS XE devices in the country with a previously undocumented implant known as BADCANDY.\nThe activity, per the intelligence agency, involves the exploitation of CVE-2023-20198 (CVSS score: 10.0), a critical vulnerability that allows a remote, unauthenticated attacker to create an",
    "contentSnippet": "The Australian Signals Directorate (ASD) has issued a bulletin about ongoing cyber attacks targeting unpatched Cisco IOS XE devices in the country with a previously undocumented implant known as BADCANDY.\nThe activity, per the intelligence agency, involves the exploitation of CVE-2023-20198 (CVSS score: 10.0), a critical vulnerability that allows a remote, unauthenticated attacker to create an",
    "guid": "https://thehackernews.com/2025/11/asd-warns-of-ongoing-badcandy-attacks.html",
    "isoDate": "2025-11-01T13:43:00.000Z",
    "itunes": {}
  },
  {
    "creator": "Bruce Schneier",
    "title": "Friday Squid Blogging: Giant Squid at the Smithsonian",
    "link": "https://www.schneier.com/blog/archives/2025/10/friday-squid-blogging-giant-squid-at-the-smithsonian.html",
    "pubDate": "Fri, 31 Oct 2025 21:06:18 +0000",
    "content:encoded": "<p>I can&#8217;t believe that I haven&#8217;t yet posted <a href=\"https://naturalhistory.si.edu/explore/giant-squid\">this picture</a> of a giant squid at the Smithsonian.</p>\n<p>As usual, you can also use this squid post to talk about the security stories in the news that I haven&#8217;t covered.</p>\n<p><a href=\"https://www.schneier.com/blog/archives/2024/06/new-blog-moderation-policy.html\">Blog moderation policy.</a></p>\n",
    "content:encodedSnippet": "I can’t believe that I haven’t yet posted this picture of a giant squid at the Smithsonian.\nAs usual, you can also use this squid post to talk about the security stories in the news that I haven’t covered.\nBlog moderation policy.",
    "dc:creator": "Bruce Schneier",
    "comments": "https://www.schneier.com/blog/archives/2025/10/friday-squid-blogging-giant-squid-at-the-smithsonian.html#comments",
    "content": "<p>I can&#8217;t believe that I haven&#8217;t yet posted <a href=\"https://naturalhistory.si.edu/explore/giant-squid\">this picture</a> of a giant squid at the Smithsonian.</p>\n<p>As usual, you can also use this squid post to talk about the security stories in the news that I haven&#8217;t covered.</p>\n<p><a href=\"https://www.schneier.com/blog/archives/2024/06/new-blog-moderation-policy.html\">Blog moderation policy.</a></p>\n",
    "contentSnippet": "I can’t believe that I haven’t yet posted this picture of a giant squid at the Smithsonian.\nAs usual, you can also use this squid post to talk about the security stories in the news that I haven’t covered.\nBlog moderation policy.",
    "guid": "https://www.schneier.com/?p=71065",
    "categories": [
      "Uncategorized",
      "squid"
    ],
    "isoDate": "2025-10-31T21:06:18.000Z"
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "OpenAI Unveils Aardvark: GPT-5 Agent That Finds and Fixes Code Flaws Automatically",
    "link": "https://thehackernews.com/2025/10/openai-unveils-aardvark-gpt-5-agent.html",
    "pubDate": "Fri, 31 Oct 2025 22:49:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi1qKVY4KhOkzIkeCDV1BiboPN3n7qh-ElZ2YzQyfHE2ctgVFmcv7KPDcx1Chvc3KxNeMuirmxfoFRlOb_YAPkCds2Pw9H0_dOPmrJPFfmGFglSXLIM6Ycu0nesaNh8hfTvfQ7lKTAp-GOCaRJylT-wId8Sb_urjjXxpqVgkrjUZ4VJboCJ7Fhk4yVZpOiS/s1600/flaws.jpg"
    },
    "content": "OpenAI has announced the launch of an \"agentic security researcher\" that's powered by its GPT-5 large language model (LLM) and is programmed to emulate a human expert capable of scanning, understanding, and patching code.\nCalled Aardvark, the artificial intelligence (AI) company said the autonomous agent is designed to help developers and security teams flag and fix security vulnerabilities at",
    "contentSnippet": "OpenAI has announced the launch of an \"agentic security researcher\" that's powered by its GPT-5 large language model (LLM) and is programmed to emulate a human expert capable of scanning, understanding, and patching code.\nCalled Aardvark, the artificial intelligence (AI) company said the autonomous agent is designed to help developers and security teams flag and fix security vulnerabilities at",
    "guid": "https://thehackernews.com/2025/10/openai-unveils-aardvark-gpt-5-agent.html",
    "isoDate": "2025-10-31T17:19:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "Nation-State Hackers Deploy New Airstalk Malware in Suspected Supply Chain Attack",
    "link": "https://thehackernews.com/2025/10/nation-state-hackers-deploy-new.html",
    "pubDate": "Fri, 31 Oct 2025 21:38:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhsKxzaqZgRJLRPcNqwG7WhPAKXXPkKpEOo3KCEyJxJAGr4jvJCJYu7f5_MKXFMBZEAYHyDeNoDbQMuA-f4OOSp74F9iEax0USQCQ0oyFWnJTn4IJc-wiXoxpiFociu-ToO04Wyjq6vry_PsdrCzezc2OvE_SD7esW9tFMPrgG2jpa1KfUoJcMPcVynngGI/s1600/cyberattack.jpg"
    },
    "content": "A suspected nation-state threat actor has been linked to the distribution of a new malware called Airstalk as part of a likely supply chain attack.\nPalo Alto Networks Unit 42 said it's tracking the cluster under the moniker CL-STA-1009, where \"CL\" stands for cluster and \"STA\" refers to state-backed motivation.\n\"Airstalk misuses the AirWatch API for mobile device management (MDM), which is now",
    "contentSnippet": "A suspected nation-state threat actor has been linked to the distribution of a new malware called Airstalk as part of a likely supply chain attack.\nPalo Alto Networks Unit 42 said it's tracking the cluster under the moniker CL-STA-1009, where \"CL\" stands for cluster and \"STA\" refers to state-backed motivation.\n\"Airstalk misuses the AirWatch API for mobile device management (MDM), which is now",
    "guid": "https://thehackernews.com/2025/10/nation-state-hackers-deploy-new.html",
    "isoDate": "2025-10-31T16:08:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "China-Linked Hackers Exploit Windows Shortcut Flaw to Target European Diplomats",
    "link": "https://thehackernews.com/2025/10/china-linked-hackers-exploit-windows.html",
    "pubDate": "Fri, 31 Oct 2025 19:27:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjuCnrmqvnmeQpjFHXNewBANRdjg6GRkj6K7cEMmTmw-qmLNdssAgQ-6Lll7hmLZ4lX7R2mUneq6t0fpl-SOf_UT-WKd7PdL9wmSrhsZngchMDjYc2E8jlWOZimaV9tHQCUBmRrOMCj-K-xOaFkPYPSNtG6RBaLDPG2XgEDNQbSr71r0U2znlvR0iUCXNBn/s1600/shortcut.jpg"
    },
    "content": "A China-affiliated threat actor known as UNC6384 has been linked to a fresh set of attacks exploiting an unpatched Windows shortcut vulnerability to target European diplomatic and government entities between September and October 2025.\nThe activity targeted diplomatic organizations in Hungary, Belgium, Italy, and the Netherlands, as well as government agencies in Serbia, Arctic Wolf said in a",
    "contentSnippet": "A China-affiliated threat actor known as UNC6384 has been linked to a fresh set of attacks exploiting an unpatched Windows shortcut vulnerability to target European diplomatic and government entities between September and October 2025.\nThe activity targeted diplomatic organizations in Hungary, Belgium, Italy, and the Netherlands, as well as government agencies in Serbia, Arctic Wolf said in a",
    "guid": "https://thehackernews.com/2025/10/china-linked-hackers-exploit-windows.html",
    "isoDate": "2025-10-31T13:57:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "China-Linked Tick Group Exploits Lanscope Zero-Day to Hijack Corporate Systems",
    "link": "https://thehackernews.com/2025/10/china-linked-tick-group-exploits.html",
    "pubDate": "Fri, 31 Oct 2025 18:56:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjZykRt-Qg6PRjnYyI3lt6G0Ygf-Pp1Ww03EXTB5nUqaXMBaS1x4f5BxGKAnizBh7wk8gGff5SgLd0j70vJ0-bOdH60rmTctKnWfppbSTWOrdIkTIhga2CReBdSHSeGnPZoIjaZ66GV0hE-6dWnbAIHdM6VukGqhiqPTnrPV5nHpLLNqKE_UKy9xyyw0du7/s1600/warning.jpg"
    },
    "content": "The exploitation of a recently disclosed critical security flaw in Motex Lanscope Endpoint Manager has been attributed to a cyber espionage group known as Tick.\nThe vulnerability, tracked as CVE-2025-61932 (CVSS score: 9.3), allows remote attackers to execute arbitrary commands with SYSTEM privileges on on-premise versions of the program. JPCERT/CC, in an alert issued this month, said that it",
    "contentSnippet": "The exploitation of a recently disclosed critical security flaw in Motex Lanscope Endpoint Manager has been attributed to a cyber espionage group known as Tick.\nThe vulnerability, tracked as CVE-2025-61932 (CVSS score: 9.3), allows remote attackers to execute arbitrary commands with SYSTEM privileges on on-premise versions of the program. JPCERT/CC, in an alert issued this month, said that it",
    "guid": "https://thehackernews.com/2025/10/china-linked-tick-group-exploits.html",
    "isoDate": "2025-10-31T13:26:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "The MSP Cybersecurity Readiness Guide: Turning Security into Growth",
    "link": "https://thehackernews.com/2025/10/the-msp-cybersecurity-readiness-guide.html",
    "pubDate": "Fri, 31 Oct 2025 17:00:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgqekRxhqSIMwXW-91BTf99RLxdfwXB5-1vhEwnAeSX55XbaEU2fhjyDONSC1rnBDBMseaqYwmBpe4nYpyDlg7m9cmg5u-934M1hZSWzihqR7Ll0acZ7jqLUcL6m9S8h-KZPMqLDyC5x3kTr4rZ3q6uUA7Lt4nWYlwr3ddJnK4AofUxhkKVl4PI0CJXoI8/s1600/TurnSecurityIntoGrowth.png"
    },
    "content": "MSPs are facing rising client expectations for strong cybersecurity and compliance outcomes, while threats grow more complex and regulatory demands evolve. Meanwhile, clients are increasingly seeking comprehensive protection without taking on the burden of managing security themselves.\nThis shift represents a major growth opportunity. By delivering advanced cybersecurity and compliance",
    "contentSnippet": "MSPs are facing rising client expectations for strong cybersecurity and compliance outcomes, while threats grow more complex and regulatory demands evolve. Meanwhile, clients are increasingly seeking comprehensive protection without taking on the burden of managing security themselves.\nThis shift represents a major growth opportunity. By delivering advanced cybersecurity and compliance",
    "guid": "https://thehackernews.com/2025/10/the-msp-cybersecurity-readiness-guide.html",
    "isoDate": "2025-10-31T11:30:00.000Z",
    "itunes": {}
  },
  {
    "creator": "Bruce Schneier",
    "title": "Will AI Strengthen or Undermine Democracy?",
    "link": "https://www.schneier.com/blog/archives/2025/10/will-ai-strengthen-or-undermine-democracy.html",
    "pubDate": "Fri, 31 Oct 2025 11:08:48 +0000",
    "content:encoded": "<p><a href=\"https://nextbigideaclub.com/magazine/will-ai-strengthen-undermine-democracy-bookbite/57574/\">Listen to the Audio on NextBigIdeaClub.com</a></p>\n<p>Below, co-authors Bruce Schneier and Nathan E. Sanders share five key insights from their new book, <em>Rewiring Democracy: How AI Will Transform Our Politics, Government, and Citizenship</em>.</p>\n<h3>What&#8217;s the big idea?</h3>\n<p>AI can be used both for and against the public interest within democracies. It is already being used in the governing of nations around the world, and there is no escaping its continued use in the future by leaders, policy makers, and legal enforcers. How we wire AI into democracy today will determine if it becomes a tool of oppression or empowerment.</p>\n<h3>1. AI&#8217;s global democratic impact is already profound.</h3>\n<p>It&#8217;s been just a few years since ChatGPT stormed into view and AI&#8217;s influence has already permeated every democratic process in governments around the world:</p>\n<ul>\n<li>In 2022, an artist collective in Denmark founded the world&#8217;s first political party committed to an AI-generated policy platform.</li>\n<li>Also in 2022, South Korean politicians running for the presidency were the first to use AI avatars to communicate with voters en masse.</li>\n<li>In 2023, a Brazilian municipal legislator passed the first enacted law written by AI.</li>\n<li>In 2024, a U.S. federal court judge started using AI to interpret the plain meaning of words in U.S. law.</li>\n<li>Also in 2024, the Biden administration disclosed more than two thousand discrete use cases for AI across the agencies of the U.S. federal government.</li>\n</ul>\n<p>The examples illustrate the diverse uses of AI across citizenship, politics, legislation, the judiciary, and executive administration.</p>\n<p>Not all of these uses will create lasting change. Some of these will be one-offs. Some are inherently small in scale. Some were publicity stunts. But each use case speaks to a shifting balance of supply and demand that AI will increasingly mediate.</p>\n<p>Legislators need assistance drafting bills and have limited staff resources, especially at the local and state level. Historically, they have looked to lobbyists and interest groups for help. Increasingly, it&#8217;s just as easy for them to use an AI tool.</p>\n<h3>2. The first places AI will be used are where there is the least public oversight.</h3>\n<p>Many of the use cases for AI in governance and politics have vocal objectors. Some make us uncomfortable, especially in the hands of authoritarians or ideological extremists.</p>\n<p>In some cases, politics will be a regulating force to prevent dangerous uses of AI. Massachusetts has banned the use of AI face recognition in law enforcement because of real concerns voiced by the public about their tendency to encode systems of racial bias.</p>\n<p>Some of the uses we think might be most impactful are unlikely to be adopted fast because of legitimate concern about their potential to make mistakes, introduce bias, or subvert human agency. AIs could be assistive tools for citizens, acting as their voting proxies to help us weigh in on larger numbers of more complex ballot initiatives, but we know that many will object to anything that verges on AIs being given a vote.</p>\n<p>But AI will continue to be rapidly adopted in some aspects of democracy, regardless of how the public feels. People within democracies, even those in government jobs, often have great independence. They don&#8217;t have to ask anyone if it&#8217;s ok to use AI, and they will use it if they see that it benefits them. The Brazilian city councilor who used AI to draft a bill did not ask for anyone&#8217;s permission. The U.S. federal judge who used AI to help him interpret law did not have to check with anyone first. And the Trump administration seems to be using AI for everything from drafting tariff policies to writing public health reports&#8212;with some obvious drawbacks.</p>\n<p>It&#8217;s likely that even the thousands of disclosed AI uses in government are only the tip of the iceberg. These are just the applications that governments have seen fit to share; the ones they think are the best vetted, most likely to persist, or maybe the least controversial to disclose.</p>\n<h3>3. Elites and authoritarians will use AI to concentrate power.</h3>\n<p>Many Westerners point to China as a cautionary tale of how AI could empower autocracy, but the reality is that AI provides structural advantages to entrenched power in democratic governments, too. The nature of automation is that it gives those at the top of a power structure more control over the actions taken at its lower levels.</p>\n<p>It&#8217;s famously hard for newly elected leaders to exert their will over the many layers of human bureaucracies. The civil service is large, unwieldy, and messy. But it&#8217;s trivial for an executive to change the parameters and instructions of an AI model being used to automate the systems of government.</p>\n<p>The dynamic of AI effectuating concentration of power extends beyond government agencies. Over the past five years, Ohio has undertaken a project to do a wholesale revision of its administrative code using AI. The leaders of that project framed it in terms of efficiency and good governance: deleting millions of words of outdated, unnecessary, or redundant language. The same technology could be applied to advance more ideological ends, like purging all statutory language that places burdens on business, neglects to hold businesses accountable, protects some class of people, or fails to protect others.</p>\n<p>Whether you like or despise automating the enactment of those policies will depend on whether you stand with or are opposed to those in power, and that&#8217;s the point. AI gives any faction with power the potential to exert more control over the levers of government.</p>\n<h3>4. Organizers will find ways to use AI to distribute power instead.</h3>\n<p>We don&#8217;t have to resign ourselves to a world where AI makes the rich richer and the elite more powerful. This is a technology that can also be wielded by outsiders to help level the playing field.</p>\n<p>In politics, AI gives upstart and local candidates access to skills and the ability to do work on a scale that used to only be available to well-funded campaigns. In the 2024 cycle, Congressional candidates running against incumbents like Glenn Cook in Georgia and Shamaine Daniels in Pennsylvania used AI to help themselves be everywhere all at once. They used AI to make personalized robocalls to voters, write frequent blog posts, and even generate podcasts in the candidate&#8217;s voice. In Japan, a candidate for Governor of Tokyo used an AI avatar to respond to more than eight thousand online questions from voters.</p>\n<p>Outside of public politics, labor organizers are also leveraging AI to build power. The Worker&#8217;s Lab is a U.S. nonprofit developing assistive technologies for labor unions, like AI-enabled apps that help service workers report workplace safety violations. The 2023 Writers&#8217; Guild of America strike serves as a blueprint for organizers. They won concessions from Hollywood studios that protect their members against being displaced by AI while also winning them guarantees for being able to use AI as assistive tools to their own benefit.</p>\n<h3>5. The ultimate democratic impact of AI depends on us.</h3>\n<p>If you are excited about AI and see the potential for it to make life, and maybe even democracy, better around the world, recognize that there are a lot of people who don&#8217;t feel the same way.</p>\n<p>If you are disturbed about the ways you see AI being used and worried about the future that leads to, recognize that the trajectory we&#8217;re on now is not the only one available.</p>\n<p>The technology of AI itself does not pose an inherent threat to citizens, workers, and the public interest. Like other democratic technologies&#8212;voting processes, legislative districts, judicial review&#8212;its impacts will depend on how it&#8217;s developed, who controls it, and how it&#8217;s used.</p>\n<p>Constituents of democracies should do four things:</p>\n<ul>\n<li><strong>Reform</strong> the technology ecosystem to be more trustworthy, so that AI is developed with more transparency, more guardrails around exploitative use of data, and public oversight.</li>\n<li><strong>Resist</strong> inappropriate uses of AI in government and politics, like facial recognition technologies that automate surveillance and encode inequity.</li>\n<li><strong>Responsibly use</strong> AI in government where it can help improve outcomes, like making government more accessible to people through translation and speeding up administrative decision processes.</li>\n<li><strong>Renovate</strong> the systems of government vulnerable to the disruptive potential of AI&#8217;s superhuman capabilities, like political advertising rules that never anticipated deepfakes.</li>\n</ul>\n<p>These four Rs are how we can rewire our democracy in a way that applies AI to truly benefit the public interest.</p>\n<p><em>This essay was written with Nathan E. Sanders, and originally appeared in <a href=\"https://nextbigideaclub.com/magazine/will-ai-strengthen-undermine-democracy-bookbite/57574/\">The Next Big Idea Club</a>.</em></p>\n",
    "content:encodedSnippet": "Listen to the Audio on NextBigIdeaClub.com\nBelow, co-authors Bruce Schneier and Nathan E. Sanders share five key insights from their new book, Rewiring Democracy: How AI Will Transform Our Politics, Government, and Citizenship.\nWhat’s the big idea?\nAI can be used both for and against the public interest within democracies. It is already being used in the governing of nations around the world, and there is no escaping its continued use in the future by leaders, policy makers, and legal enforcers. How we wire AI into democracy today will determine if it becomes a tool of oppression or empowerment.\n1. AI’s global democratic impact is already profound.\nIt’s been just a few years since ChatGPT stormed into view and AI’s influence has already permeated every democratic process in governments around the world:\nIn 2022, an artist collective in Denmark founded the world’s first political party committed to an AI-generated policy platform.\nAlso in 2022, South Korean politicians running for the presidency were the first to use AI avatars to communicate with voters en masse.\nIn 2023, a Brazilian municipal legislator passed the first enacted law written by AI.\nIn 2024, a U.S. federal court judge started using AI to interpret the plain meaning of words in U.S. law.\nAlso in 2024, the Biden administration disclosed more than two thousand discrete use cases for AI across the agencies of the U.S. federal government.\nThe examples illustrate the diverse uses of AI across citizenship, politics, legislation, the judiciary, and executive administration.\nNot all of these uses will create lasting change. Some of these will be one-offs. Some are inherently small in scale. Some were publicity stunts. But each use case speaks to a shifting balance of supply and demand that AI will increasingly mediate.\nLegislators need assistance drafting bills and have limited staff resources, especially at the local and state level. Historically, they have looked to lobbyists and interest groups for help. Increasingly, it’s just as easy for them to use an AI tool.\n2. The first places AI will be used are where there is the least public oversight.\nMany of the use cases for AI in governance and politics have vocal objectors. Some make us uncomfortable, especially in the hands of authoritarians or ideological extremists.\nIn some cases, politics will be a regulating force to prevent dangerous uses of AI. Massachusetts has banned the use of AI face recognition in law enforcement because of real concerns voiced by the public about their tendency to encode systems of racial bias.\nSome of the uses we think might be most impactful are unlikely to be adopted fast because of legitimate concern about their potential to make mistakes, introduce bias, or subvert human agency. AIs could be assistive tools for citizens, acting as their voting proxies to help us weigh in on larger numbers of more complex ballot initiatives, but we know that many will object to anything that verges on AIs being given a vote.\nBut AI will continue to be rapidly adopted in some aspects of democracy, regardless of how the public feels. People within democracies, even those in government jobs, often have great independence. They don’t have to ask anyone if it’s ok to use AI, and they will use it if they see that it benefits them. The Brazilian city councilor who used AI to draft a bill did not ask for anyone’s permission. The U.S. federal judge who used AI to help him interpret law did not have to check with anyone first. And the Trump administration seems to be using AI for everything from drafting tariff policies to writing public health reports—with some obvious drawbacks.\nIt’s likely that even the thousands of disclosed AI uses in government are only the tip of the iceberg. These are just the applications that governments have seen fit to share; the ones they think are the best vetted, most likely to persist, or maybe the least controversial to disclose.\n3. Elites and authoritarians will use AI to concentrate power.\nMany Westerners point to China as a cautionary tale of how AI could empower autocracy, but the reality is that AI provides structural advantages to entrenched power in democratic governments, too. The nature of automation is that it gives those at the top of a power structure more control over the actions taken at its lower levels.\nIt’s famously hard for newly elected leaders to exert their will over the many layers of human bureaucracies. The civil service is large, unwieldy, and messy. But it’s trivial for an executive to change the parameters and instructions of an AI model being used to automate the systems of government.\nThe dynamic of AI effectuating concentration of power extends beyond government agencies. Over the past five years, Ohio has undertaken a project to do a wholesale revision of its administrative code using AI. The leaders of that project framed it in terms of efficiency and good governance: deleting millions of words of outdated, unnecessary, or redundant language. The same technology could be applied to advance more ideological ends, like purging all statutory language that places burdens on business, neglects to hold businesses accountable, protects some class of people, or fails to protect others.\nWhether you like or despise automating the enactment of those policies will depend on whether you stand with or are opposed to those in power, and that’s the point. AI gives any faction with power the potential to exert more control over the levers of government.\n4. Organizers will find ways to use AI to distribute power instead.\nWe don’t have to resign ourselves to a world where AI makes the rich richer and the elite more powerful. This is a technology that can also be wielded by outsiders to help level the playing field.\nIn politics, AI gives upstart and local candidates access to skills and the ability to do work on a scale that used to only be available to well-funded campaigns. In the 2024 cycle, Congressional candidates running against incumbents like Glenn Cook in Georgia and Shamaine Daniels in Pennsylvania used AI to help themselves be everywhere all at once. They used AI to make personalized robocalls to voters, write frequent blog posts, and even generate podcasts in the candidate’s voice. In Japan, a candidate for Governor of Tokyo used an AI avatar to respond to more than eight thousand online questions from voters.\nOutside of public politics, labor organizers are also leveraging AI to build power. The Worker’s Lab is a U.S. nonprofit developing assistive technologies for labor unions, like AI-enabled apps that help service workers report workplace safety violations. The 2023 Writers’ Guild of America strike serves as a blueprint for organizers. They won concessions from Hollywood studios that protect their members against being displaced by AI while also winning them guarantees for being able to use AI as assistive tools to their own benefit.\n5. The ultimate democratic impact of AI depends on us.\nIf you are excited about AI and see the potential for it to make life, and maybe even democracy, better around the world, recognize that there are a lot of people who don’t feel the same way.\nIf you are disturbed about the ways you see AI being used and worried about the future that leads to, recognize that the trajectory we’re on now is not the only one available.\nThe technology of AI itself does not pose an inherent threat to citizens, workers, and the public interest. Like other democratic technologies—voting processes, legislative districts, judicial review—its impacts will depend on how it’s developed, who controls it, and how it’s used.\nConstituents of democracies should do four things:\nReform the technology ecosystem to be more trustworthy, so that AI is developed with more transparency, more guardrails around exploitative use of data, and public oversight.\nResist inappropriate uses of AI in government and politics, like facial recognition technologies that automate surveillance and encode inequity.\nResponsibly use AI in government where it can help improve outcomes, like making government more accessible to people through translation and speeding up administrative decision processes.\nRenovate the systems of government vulnerable to the disruptive potential of AI’s superhuman capabilities, like political advertising rules that never anticipated deepfakes.\nThese four Rs are how we can rewire our democracy in a way that applies AI to truly benefit the public interest.\nThis essay was written with Nathan E. Sanders, and originally appeared in The Next Big Idea Club.",
    "dc:creator": "Bruce Schneier",
    "comments": "https://www.schneier.com/blog/archives/2025/10/will-ai-strengthen-or-undermine-democracy.html#comments",
    "content": "<p><a href=\"https://nextbigideaclub.com/magazine/will-ai-strengthen-undermine-democracy-bookbite/57574/\">Listen to the Audio on NextBigIdeaClub.com</a></p>\n<p>Below, co-authors Bruce Schneier and Nathan E. Sanders share five key insights from their new book, <em>Rewiring Democracy: How AI Will Transform Our Politics, Government, and Citizenship</em>.</p>\n<h3>What&#8217;s the big idea?</h3>\n<p>AI can be used both for and against the public interest within democracies. It is already being used in the governing of nations around the world, and there is no escaping its continued use in the future by leaders, policy makers, and legal enforcers. How we wire AI into democracy today will determine if it becomes a tool of oppression or empowerment...</p>",
    "contentSnippet": "Listen to the Audio on NextBigIdeaClub.com\nBelow, co-authors Bruce Schneier and Nathan E. Sanders share five key insights from their new book, Rewiring Democracy: How AI Will Transform Our Politics, Government, and Citizenship.\nWhat’s the big idea?\nAI can be used both for and against the public interest within democracies. It is already being used in the governing of nations around the world, and there is no escaping its continued use in the future by leaders, policy makers, and legal enforcers. How we wire AI into democracy today will determine if it becomes a tool of oppression or empowerment...",
    "guid": "https://www.schneier.com/?p=71078",
    "categories": [
      "Uncategorized",
      "AI",
      "democracy",
      "LLM"
    ],
    "isoDate": "2025-10-31T11:08:48.000Z"
  },
  {
    "creator": "Lauren Goode, Michael Calore, Andy Greenberg",
    "title": "How to Hack a Poker Game",
    "link": "https://www.wired.com/story/uncanny-valley-podcast-how-to-hack-a-poker-game/",
    "pubDate": "Fri, 31 Oct 2025 09:00:00 +0000",
    "dc:creator": "Lauren Goode, Michael Calore, Andy Greenberg",
    "content": "This week on Uncanny Valley, we break down how one of the most common card shufflers could be altered to cheat, and why that matters—even for those who don’t frequent the poker table.",
    "contentSnippet": "This week on Uncanny Valley, we break down how one of the most common card shufflers could be altered to cheat, and why that matters—even for those who don’t frequent the poker table.",
    "guid": "6901645683c4ffb306eab380",
    "categories": [
      "Security",
      "Security / Cyberattacks and Hacks"
    ],
    "isoDate": "2025-10-31T09:00:00.000Z"
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "CISA and NSA Issue Urgent Guidance to Secure WSUS and Microsoft Exchange Servers",
    "link": "https://thehackernews.com/2025/10/cisa-and-nsa-issue-urgent-guidance-to.html",
    "pubDate": "Fri, 31 Oct 2025 14:16:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjA0I1Jx6uIEdkIQQM9RnxL2Ki39vb2gH7eog9Bm7oLXHB3Ia60PLtDJsEuqlPrOsZLL9UJZ3YnnlRxxQv0zGB_pNQcpQvDlxnFR1c6_iN-NzNkRMt3sW38md0OI8cJDfVQ5wp6rvZD32HiKk_NuHiFdTbo0mQRf8BfoNVFmp283z-01nb_Z7oGhyqSdE4P/s1600/ms.jpg"
    },
    "content": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) and National Security Agency (NSA), along with international partners from Australia and Canada, have released guidance to harden on-premise Microsoft Exchange Server instances from potential exploitation.\n\"By restricting administrative access, implementing multi-factor authentication, enforcing strict transport security",
    "contentSnippet": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) and National Security Agency (NSA), along with international partners from Australia and Canada, have released guidance to harden on-premise Microsoft Exchange Server instances from potential exploitation.\n\"By restricting administrative access, implementing multi-factor authentication, enforcing strict transport security",
    "guid": "https://thehackernews.com/2025/10/cisa-and-nsa-issue-urgent-guidance-to.html",
    "isoDate": "2025-10-31T08:46:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "Eclipse Foundation Revokes Leaked Open VSX Tokens Following Wiz Discovery",
    "link": "https://thehackernews.com/2025/10/eclipse-foundation-revokes-leaked-open.html",
    "pubDate": "Fri, 31 Oct 2025 13:32:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgmAGBrh3pirqFHrsdc4kBfinnWBWhRLbAAwa39k5lyd-X941olCKyizc7VGdYORWLq6aBGn3l6f4zMwwUApVP3pfEk_dzr31Kh1eiBZjzzoqik3-9UrwJmD8eWbjd8OY7clyxw1qqOHcBCarQxd-7hvKhhiLjl6fRbBUl-UV4Dvs5KAWLbHwTNkYxAfIBC/s1600/open.jpg"
    },
    "content": "Eclipse Foundation, which maintains the open-source Open VSX project, said it has taken steps to revoke a small number of tokens that were leaked within Visual Studio Code (VS Code) extensions published in the marketplace.\nThe action comes following a report from cloud security company Wiz earlier this month, which found several extensions from both Microsoft's VS Code Marketplace and Open VSX",
    "contentSnippet": "Eclipse Foundation, which maintains the open-source Open VSX project, said it has taken steps to revoke a small number of tokens that were leaked within Visual Studio Code (VS Code) extensions published in the marketplace.\nThe action comes following a report from cloud security company Wiz earlier this month, which found several extensions from both Microsoft's VS Code Marketplace and Open VSX",
    "guid": "https://thehackernews.com/2025/10/eclipse-foundation-revokes-leaked-open.html",
    "isoDate": "2025-10-31T08:02:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "CISA Flags VMware Zero-Day Exploited by China-Linked Hackers in Active Attacks",
    "link": "https://thehackernews.com/2025/10/cisa-flags-vmware-zero-day-exploited-by.html",
    "pubDate": "Fri, 31 Oct 2025 12:39:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgI9b0-qhv23XfDSOcojqy0VRkWHB99nq_dbwTnEfuC2Osi_-aKm2iRqK7rip6h8Gh4C4hP6ySCTTm_OoKVpLRIzNJBPcsoQlVjry-zfmX71nhF4-84Gd4D7XCPhPN8v6CkBo6PJUh5zv-hLSjXQNFi0dW5yS7Dbk03PSNEVCn8nEUGvO6NvV7cDmoYHfaF/s1600/vmware.jpg"
    },
    "content": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Thursday added a high-severity security flaw impacting Broadcom VMware Tools and VMware Aria Operations to its Known Exploited Vulnerabilities (KEV) catalog, following reports of active exploitation in the wild.\nThe vulnerability in question is CVE-2025-41244 (CVSS score: 7.8), which could be exploited by an attacker to attain",
    "contentSnippet": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Thursday added a high-severity security flaw impacting Broadcom VMware Tools and VMware Aria Operations to its Known Exploited Vulnerabilities (KEV) catalog, following reports of active exploitation in the wild.\nThe vulnerability in question is CVE-2025-41244 (CVSS score: 7.8), which could be exploited by an attacker to attain",
    "guid": "https://thehackernews.com/2025/10/cisa-flags-vmware-zero-day-exploited-by.html",
    "isoDate": "2025-10-31T07:09:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "A New Security Layer for macOS Takes Aim at Admin Errors Before Hackers Do",
    "link": "https://thehackernews.com/2025/10/a-new-security-layer-for-macos-takes.html",
    "pubDate": "Fri, 31 Oct 2025 09:07:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgHpAYTsxkWCgKoj_4IbW-z4a9m9r8KWH6oc0a5N7B68vil9GiBeKNPIHE3HcJY3_VZOqcGA1tLpTkDvB2sMsNMazRRyBT0bxqAQHoojAyY5btgMibphXUZ8GGhfyuzUuvSHuDQpaEpIKNsCGvjbm6yC8E8GDex9TjHtLNLF0jLBLQlL0iXPmF5nUf7W6k/s1600/threatlocker.jpg"
    },
    "content": "A design firm is editing a new campaign video on a MacBook Pro. The creative director opens a collaboration app that quietly requests microphone and camera permissions. MacOS is supposed to flag that, but in this case, the checks are loose. The app gets access anyway.\nOn another Mac in the same office, file sharing is enabled through an old protocol called SMB version one. It’s fast and",
    "contentSnippet": "A design firm is editing a new campaign video on a MacBook Pro. The creative director opens a collaboration app that quietly requests microphone and camera permissions. MacOS is supposed to flag that, but in this case, the checks are loose. The app gets access anyway.\nOn another Mac in the same office, file sharing is enabled through an old protocol called SMB version one. It’s fast and",
    "guid": "https://thehackernews.com/2025/10/a-new-security-layer-for-macos-takes.html",
    "isoDate": "2025-10-31T03:37:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "Google's Built-In AI Defenses on Android Now Block 10 Billion Scam Messages a Month",
    "link": "https://thehackernews.com/2025/10/googles-built-in-ai-defenses-on-android.html",
    "pubDate": "Thu, 30 Oct 2025 22:30:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiLzNvcgKF1dzPvi41-IVyFcKKds42WP88xnqZjnxYUBHHdDLsJCHd26MwwUHs8NOi4I3-8c90rzegdXeQ283lfQiwGgy3vRZumlIEjZXf8CaVGYTgoBcAwuPArPEDJVl6eT_ioKsqdDdOsm7Vj4Bl8BLMF1xcZ5wZZa_Ga9vIcfgMVHYJLxEtK5stcFYHq/s1600/android-spam.jpg"
    },
    "content": "Google on Thursday revealed that the scam defenses built into Android safeguard users around the world from more than 10 billion suspected malicious calls and messages every month.\nThe tech giant also said it has blocked over 100 million suspicious numbers from using Rich Communication Services (RCS), an evolution of the SMS protocol, thereby preventing scams before they could even be sent.\nIn",
    "contentSnippet": "Google on Thursday revealed that the scam defenses built into Android safeguard users around the world from more than 10 billion suspected malicious calls and messages every month.\nThe tech giant also said it has blocked over 100 million suspicious numbers from using Rich Communication Services (RCS), an evolution of the SMS protocol, thereby preventing scams before they could even be sent.\nIn",
    "guid": "https://thehackernews.com/2025/10/googles-built-in-ai-defenses-on-android.html",
    "isoDate": "2025-10-30T17:00:00.000Z",
    "itunes": {}
  },
  {
    "creator": "Dell Cameron",
    "title": "ICE Wants to Build a Shadow Deportation Network in Texas",
    "link": "https://www.wired.com/story/ice-is-building-a-24-7-shadow-transportation-network-across-texas/",
    "pubDate": "Thu, 30 Oct 2025 16:48:24 +0000",
    "dc:creator": "Dell Cameron",
    "content": "A new ICE proposal outlines a 24/7 transport operation run by armed contractors—turning Texas into the logistical backbone of an industrialized deportation machine.",
    "contentSnippet": "A new ICE proposal outlines a 24/7 transport operation run by armed contractors—turning Texas into the logistical backbone of an industrialized deportation machine.",
    "guid": "690268b59f45e40ae292076c",
    "categories": [
      "Security",
      "Security / National Security",
      "Security / Security News",
      "Politics / Policy"
    ],
    "isoDate": "2025-10-30T16:48:24.000Z"
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "Russian Ransomware Gangs Weaponize Open-Source AdaptixC2 for Advanced Attacks",
    "link": "https://thehackernews.com/2025/10/russian-ransomware-gangs-weaponize-open.html",
    "pubDate": "Thu, 30 Oct 2025 22:10:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhHAemb8q0dPL4UJx7V6h0octnu9dSgvaV0KNS8ctKdDRlcrt51uM9BXud3jaJ7Gkc-NGMJfTfTmShpq9ehcNjW2nh-ncTHD37MRt9iY7ThMZKxp_ULdweMDi6iI0O8m_LkZV0N8Yegr1VWMxRUviU5h8jb3z0wlcxzru3Zu48O0AojPbgLvxLOQ8pEDBlS/s1600/post-install.jpg"
    },
    "content": "The open-source command-and-control (C2) framework known as AdaptixC2 is being used by a growing number of threat actors, some of whom are related to Russian ransomware gangs.\nAdaptixC2 is an emerging extensible post-exploitation and adversarial emulation framework designed for penetration testing. While the server component is written in Golang, the GUI Client is written in C++ QT for",
    "contentSnippet": "The open-source command-and-control (C2) framework known as AdaptixC2 is being used by a growing number of threat actors, some of whom are related to Russian ransomware gangs.\nAdaptixC2 is an emerging extensible post-exploitation and adversarial emulation framework designed for penetration testing. While the server component is written in Golang, the GUI Client is written in C++ QT for",
    "guid": "https://thehackernews.com/2025/10/russian-ransomware-gangs-weaponize-open.html",
    "isoDate": "2025-10-30T16:40:00.000Z",
    "itunes": {}
  },
  {
    "creator": "info@thehackernews.com (The Hacker News)",
    "title": "New \"Brash\" Exploit Crashes Chromium Browsers Instantly with a Single Malicious URL",
    "link": "https://thehackernews.com/2025/10/new-brash-exploit-crashes-chromium.html",
    "pubDate": "Thu, 30 Oct 2025 20:15:00 +0530",
    "author": "info@thehackernews.com (The Hacker News)",
    "enclosure": {
      "length": "12216320",
      "type": "image/jpeg",
      "url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiNPzPbEzMX4dgK-yQVcB_TZXkH8V42XYSGCEGgQzI6P0g0Mm4ozB-fC14LrYJw5mZfhA0swpNl5ZAs86tjzY7ayJGrewr7fH0S8rFsua_8J-C8ImR-04v88SotHPlzODcEHnMTAx_RGrpZHs0g9xYJ_bwsjnHIhDtIm105OhACGkcForfh0W9NmcurastV/s1600/brach.jpg"
    },
    "content": "A severe vulnerability disclosed in Chromium's Blink rendering engine can be exploited to crash many Chromium-based browsers within a few seconds.\nSecurity researcher Jose Pino, who disclosed details of the flaw, has codenamed it Brash.\n\"It allows any Chromium browser to collapse in 15-60 seconds by exploiting an architectural flaw in how certain DOM operations are managed,\" Pino said in a",
    "contentSnippet": "A severe vulnerability disclosed in Chromium's Blink rendering engine can be exploited to crash many Chromium-based browsers within a few seconds.\nSecurity researcher Jose Pino, who disclosed details of the flaw, has codenamed it Brash.\n\"It allows any Chromium browser to collapse in 15-60 seconds by exploiting an architectural flaw in how certain DOM operations are managed,\" Pino said in a",
    "guid": "https://thehackernews.com/2025/10/new-brash-exploit-crashes-chromium.html",
    "isoDate": "2025-10-30T14:45:00.000Z",
    "itunes": {}
  },
  {
    "creator": "Jay Bennett",
    "title": "NASA’s Quiet Supersonic Jet Takes Flight",
    "link": "https://www.wired.com/story/nasas-quiet-supersonic-jet-takes-flight/",
    "pubDate": "Thu, 30 Oct 2025 14:20:59 +0000",
    "dc:creator": "Jay Bennett",
    "content": "The X-59 successfully completed its inaugural flight—a step toward developing quieter supersonic jets that could one day fly customers more than twice as fast as commercial airliners.",
    "contentSnippet": "The X-59 successfully completed its inaugural flight—a step toward developing quieter supersonic jets that could one day fly customers more than twice as fast as commercial airliners.",
    "guid": "689c61c8cb2b403352b1f33d",
    "categories": [
      "Science",
      "Security"
    ],
    "isoDate": "2025-10-30T14:20:59.000Z"
  },
  {
    "creator": "Scott Gilbertson, Jacob Roach",
    "title": "8 Best Password Managers (2025), Tested and Reviewed",
    "link": "https://www.wired.com/story/best-password-managers/",
    "pubDate": "Thu, 30 Oct 2025 12:00:00 +0000",
    "dc:creator": "Scott Gilbertson, Jacob Roach",
    "content": "Keep your logins locked down with our favorite password management apps for PC, Mac, Android, iPhone, and web browsers.",
    "contentSnippet": "Keep your logins locked down with our favorite password management apps for PC, Mac, Android, iPhone, and web browsers.",
    "guid": "5ce3031cfd8c3451c5008275",
    "categories": [
      "Gear",
      "Security",
      "Gear / Buying Guides",
      "Security / Security Advice"
    ],
    "isoDate": "2025-10-30T12:00:00.000Z"
  }
]